{
    "大眾運輸": {
        "subtitles": [
            {
                "subtitle": "公車",
                "content": "在台大四周都有開往各種地方的公車站，像是體育館外、男一宿前、公館附近都有很多公車可以坐，然後在傅鐘那邊也有開往城中校區（台大醫學院）的接駁車。"
            },
            {
                "subtitle": "捷運",
                "content": "在台大附近的捷運站有公館站、科技大樓站。公館站在台大正門附近，位於羅斯福路上，屬於新店線（綠線），需要注意的點是有不少「松山－台電大樓」的車（台電大樓是公館前一站），要到學校的話就要等下一班。科技大樓站則是在復興南路上，社科院出校門之後直走就到了，屬於文湖線（棕線），車廂較小而且速度較慢，而且轉車需步行的距離較遠、較不方便。"
            },
            {
                "subtitle": "末班車",
                "content": "如果因為趕作業或是弄活動，很晚才離開學校，就會需要注意末班車時間了。所有的捷運線都會在午夜 12 點從端點站發末班車，因此離端點越遠的車站，末班車就越晚，有一些車站還會在 12 點後發專門讓人可以轉乘的車。臺北捷運網站可以查到所有車站的末班車，以及如果要轉乘的話最晚什麼時候要搭車的時間。"
            }
        ]
    },
    "腳踏車": {
        "subtitles": [
            {
                "subtitle": "YouBike",
                "content": "YouBike 是腳踏車的租借系統，只要有租車站的地方，就可以借走，然後騎到其他車站還車，最近 YouBike 的車站越來越多，而且也很好騎，所以可以看到越來越多人在路上騎著 YouBike。\n\nYouBike 的收費是 30 分鐘內 5 元，之後每 30 分鐘 10 元，然後 4 小時之後每 30 分鐘 20 元， 8 小時之後每 30 分鐘 40 元（不過應該不會有人借那麼久），然後搭配公車或捷運會有一小時內轉乘優惠 5 元。\n\n由於會有很多人從系館騎 YouBike 到捷運站，所以在晚上系館附近常常沒車，然後在白天捷運站出口常常沒車，所以騎之前可以先上網查好哪裡有車可以借。\n\n臺北市的所有 YouBike 站都是 YouBike 2.0，但由於新北市仍有部份 YouBike 1.0 的站，如果有事要騎到新北市的話注意要還到的站是否為 YouBike 2.0。\n\n系館附近有三個 YouBike 站點，分別在正門出去右轉（臺大社會系館南側）、德田與博理館之間的空地（臺大博理館西側）、正門出去直走（臺大心理系館南側）。就算很不幸的都沒車的話，說不定多走一下就可以看到零星幾台還沒被借走的車。\n\n最後要提醒一下，車柱上可能會看到有些車子坐墊是被反轉的，這代表那台腳踏車是故障的，希望不要有人去騎。不過如果你不嫌棄椅子難坐、車子騎不動的話，還是可以把它借走的。"
            },
            {
                "subtitle": "獲得腳踏車",
                "content": "如果你想買一台腳踏車，可以到以下地方獲得：",
                "subsubtitles": [
                    {
                        "subsubtitle": "水源校區二手車拍賣",
                        "content": "水源校區有一個腳踏車拖吊場，會將一些沒人領回但可以騎的腳踏車，或是已經報廢但修好的腳踏車，拿出來以二手車的方式賣給台大的師生（因為只賣給師生所以要記得帶學生證）。拍賣的時間是每個星期四早上 8:00 ，依據車子品質價位分為 600 / 800 / 1200，不過剛開學的時候應該會有很多人排，可能要六點多就在那邊等才買的到。"
                    },
                    {
                        "subsubtitle": "191 自轉車工坊",
                        "content": "在社科院出去的復興南路上，可以到車行修理腳踏車或買新車（有時候會出現二手車），大概花兩千多塊就可以買到一台不錯的新車。然後聽說某些地區的友會（例如雄友會）可以有優惠，價格會比較便宜，甚至有可能會送火箭筒、車鎖之類的配件。"
                    },
                    {
                        "subsubtitle": "小福腳踏車店（志雄腳踏車）",
                        "content": "地點就在小福對面，有賣新車或二手車，不過主要還是提供修車服務。台大師生維修有九折優惠，還設有自助輪胎打氣跟鏈條加油區。下課的時候，排隊估價的隊伍有時候蠻長的，如果是一下子馬上修好的就馬上修。如果不行，就要把腳踏車留在店裡，時間到再拿號碼牌領車。"
                    }
                ]
            },
            {
                "subtitle": "辦車證",
                "content": "在獲得自己的腳踏車之後，首先你需要去辦車證貼在車子上（雖然沒辦好像也不會怎樣，不過違停被拖吊會比較麻煩就是了）。申請車證的流程大概是：線上登記 → 去水源校區領印出來的車證。但因為水源校區很遠，所以學校事務處有提供到事務處領的服務或是在開學的時候幫你送到系館的服務。車證上都會有自己的學號，所以當你的車出事的時候會比較容易讓你知道，同樣的當你的車惹事的時候會比較容易被放到台大交流版讓大家知道。"
            },
            {
                "subtitle": "停放腳踏車",
                "content": "雖然停放腳踏車看似簡單，但是身為台大學生的你必須非常小心，一個不小心你的車可能就沒了。\n\n首先是記得要鎖車，雖然鎖車不一定保證安全，但不鎖的話就等著被偷吧。在台大交流板上面可以看到路上會有一堆偷車賊，就算只離開五分鐘，回來就看不到自己的車了。\n\n再來是停車要停對地方，在台大違停的現象非常常見，通常合法的停車區域會有停車格或車架。校內常常會有拖吊卡車巡視（俗稱水源阿伯），把違停的車都吊走，接著用粉筆在地板上寫「吊水源」這三個字，然後如果有辦車證的話應該會收到一封信。所以大家一定要把車停在正確的地方，不然就得跑去離系館很遠的水源校區才能把車子領回來，而且必須要在上班時間才能領。此外，如果有貼車證的話，每學年有兩次免費拖吊的額度，之後每次拖吊就要付 50 元的保管費了。（如果是校外違停的話可能會被吊到龍門國中那邊，而且保管費會更貴）\n\n另外要注意有些停車區會有時段限制，不是隨時都能停，所以停的時候要看一下旁邊的告示牌。除此之外還有大一女附近的停車場（公館站 3 號出口那邊），它被分為 1 ~ 7 號停車區，然後每個月的 1 ~ 7 號（寒暑假除外）會清空那個號碼的停車區，如果不小心把車留在那裡就得跑一趟水源喔。"
            },
            {
                "subtitle": "水源阿伯",
                "content": "最後，要來著重介紹一下水源阿伯。只要你是有打算在校園使用腳踏車的，都必須要認識這位令臺大學生們聞風喪膽、任職期間聯集比歷屆校長都還要久的古董級人物——水源阿伯。有關於水源阿伯的真實身份一直是個迷，有人說，水源阿伯心狠手辣，連租來的 Youbike 都拖，害他要付 5000 多塊的車費。也有人說，水源阿伯無所不在，他隨時潛伏在每個騎腳踏車的學生身旁，只要你違規停車並離開，就算只是打算進教室送個停修單就走，再回來後，也只能看到一台載著你腳踏車的卡車離開了。\n\n不過，水源阿伯在臺大學生心裡其實算是個令人又愛又恨的存在，恨的部份不必多說，愛的部份是當你真的被拖車，要去領車時，水源阿伯會親切的提醒你要記得保養車子。而且有時候，當你發現彩虹區有一排不是你的車子被拖走，讓你有地方可以停車時，一股幸災樂禍的喜悅不禁油然而生。\n\n因此，大家一定要小心，才能避免車子被拖去只有 1.3 顆星評價的水源拖吊場。水源阿伯通常只有在非假日才會拖車，因此在國定假日或是週末時，可以放心的把腳踏車停在方便的地方。不過要注意，寒暑假不算是國定假日，所以寒暑假來學校時還是要乖乖停車。另外，如果你沒有申請車證的話，要小心不要把腳踏車閒置在停車場太久，不然會被水源阿伯綁上一張紅色的紙提醒，過一段時間沒被撕掉的話，就會被送去拖吊場了喔。"
            }
        ]
    },
    "生活百貨": {
        "subtitles": [
            {
                "subtitle": "校內",
                "subsubtitles": [
                    {
                        "subsubtitle": "小福",
                        "content": "地下室有賣文具。一樓有賣一些麵包、零食（有點像便利商店那樣），也有郵局，然後在走道有賣便當。二樓有幾家餐廳，也有位子可以內用。三樓有金興發，可以到那邊買文具。"
                    },
                    {
                        "subsubtitle": "大福",
                        "content": "在共同教學館附近，位於農綜館地下室的一間福利社，有賣各種生活用品。"
                    },
                    {
                        "subsubtitle": "小小福",
                        "content": "在小木屋鬆餅旁邊，主要是賣吃的東西。"
                    }
                ]
            },
            {
                "subtitle": "校外",
                "subsubtitles": [
                    {
                        "subsubtitle": "勝立百貨",
                        "content": "在捷運科技大樓站旁邊，有賣很多文具跟日常生活用品。"
                    },
                    {
                        "subsubtitle": "光南",
                        "content": "在公館站往基隆路方向走的路上，黃色招牌那家，是一家批發連鎖店，有賣各種生活用品、文具。"
                    },
                    {
                        "subsubtitle": "全聯",
                        "content": "台大附近有三家，一家在科技大樓站附近，另一家在樂業街上（沿基隆路往和平高中方向走一段後右轉），還有一家在泰順街上（新體出去沿著辛亥路的橋走一段後右轉）。"
                    }
                ]
            }
        ]
    },
    "導生": {
        "subtitles": [
            {
                "subtitle": "導生宴",
                "content": "每個人在系上都有自己學號對應到的導師（某個教授），有些導師會請邀請他的學生一起吃飯。不過並不是每個導師都會有導生宴，想知道更多的話可以向直屬學長姐打聽看看。如果真的很想吃免錢的導生宴的話，可以找一些系上看起來人很好的教授，然後禮貌的寄信詢問，說不定有機會收到回覆喔！"
            }
        ]
    }
}