[
  {
    "title": "胖老爹",
    "cx": 1285,
    "cy": 530
  },{
    "title": "芝加哥比薩",
    "cx": 1285,
    "cy": 1400
  },{
    "title": "池先生",
    "cx": 1285,
    "cy": 1500
  },{
    "title": "Barkers",
    "cx": 950,
    "cy": 870,
    "description": "如果哪一天你心情特別好，覺得應該要來多花點錢吃飯來慶祝的話，可以考慮來 Barkers 吃個美式漢堡或是手工披薩。這間店內的餐點大約在 200 元左右，筆者來這間店都會點各種不同口味的漢堡，吃著厚實多汁的肉排，搭配套餐所附的薯條或沙拉以及無限暢飲的飲料，可謂是一種花錢的享受！"
  },
  {
    "title": "小圓村",
    "cx": 950,
    "cy": 905,
    "description": "位於 118 巷的中段，是一間非常平價的茶飲簡餐店，每種餐點都是一種主餐搭配幾種配菜，主餐有像是炸雞排或是炸排骨，有一點像是便當的搭配方式不過無論是配餐還是主食都非常好吃，是筆者在 118 巷最推薦的餐廳。小圓村的餐點基本上都是 100 元出頭，而且在點了一份餐點後，除了有免費的紅茶可以選擇，也可以加價配其他飲料，其中甚至可以以 40 塊的金額喝到 1 公升的珍珠奶茶，大家有機會一定要來試試！"
  },
  {
    "title": "阿孟石碗燒河粉",
    "cx": 950,
    "cy": 1635,
    "description": "走進 118 巷後不久就會看到大大的招牌。除了河粉以外，還有石鍋飯、石鍋麵包、咖哩飯等等的餐點，都不錯吃，另外還有可以無限喝的湯。店內的位子很多，適合一大群人一起去慢慢吃聊天（因為很燙要吃很久）。"
  },
  {
    "title": "湘記",
    "cx": 950,
    "cy": 1240,
    "description": "在 118 巷內，有賣好吃的炒飯、拌麵、跟乾鍋。曾經有兩間店面，不過現在只剩下面向118巷在Comebuy隔壁的店面了，這間店的炒飯我覺得是整條118巷最好吃的，另外也有CP值相當高的各種拌麵，以及價格稍高但相當美味的乾鍋（白飯吃到飽）。除此之外，還有飲料機喝到飽，雖然只是可樂等簡單的飲料，但在炎炎夏日中還是相當解渴。"
  },
  {
    "title": "老哥雞肉飯乾拌麵",
    "cx": 865,
    "cy": 905,
    "description": "位於小圓村對面，餐點主要分為雞肉飯和乾拌麵兩類，雞肉飯選用了整隻無骨雞腿搭配濃郁的醬汁，而秘製乾拌麵可以吃到溏心蛋和酥脆油條，都非常美味。筆者最推薦的是 149 元的雞肉飯套餐配凍檸七或是泰奶，CP 值非常高。如果嫌一隻雞不夠的話，也可以選擇 199 元的雙份雞肉飯，看起來貴了不少，但個人認為非常值得，大家一定要來吃吃看。"
  },
  {
    "title": "樂和牛排",
    "cx": 865,
    "cy": 345,
    "description": "走到接近 118 巷的尾端，驚見一家牛排店，上面寫著「附飲料、冰淇淋，贈酥皮濃湯」，難道你不會心動嗎？每份餐點都有鐵板麵+蛋，價格的部分牛排、豬排 $170 ，雞腿排 $180 ，也可以選雙拼 $260，以牛排店來說還算平價。搭配無限享用的紅茶、柳橙汁和各種口味的冰淇淋，絕對是物超所值，唯一的缺點是因為太過熱門，有時候需要排到三十分鐘的隊才能吃到。"
  },
  {
    "title": "I'm Pasta",
    "cx": 865,
    "cy": 1250,
    "description": "一家平價義大利麵/燉飯店，平均價位大概 120 ~ 140元，出示台大學生證會送檸檬紅茶。個人認為這家義大利麵的醬汁相較於其他平價義大利麵來說還算不錯，不會太水。然後有個很酷的點是加麵需要 30 元，但加飯卻不用錢，如果很餓或食量很大的話建議點燉飯然後加飯，不然原本的份量可能會吃不飽。"
  },
  {
    "title": "呈信鵝肉",
    "cx": 580,
    "cy": 80,
    "description": "這又是一間不在118巷上的美食，但這間鵝肉店值得跋涉整條118巷抵達，120元就可以買到一碗滿滿美味鵝肉的鵝肉飯，鵝油香味滿溢，非常好吃。"
  },
  {
    "title": "Home Slice Pizza",
    "cx": 735,
    "cy": 1305,
    "description": "藏在 52 弄的一間美式披薩店，餅皮是容易咀嚼的厚度，吃起來也不會有很容易膩的感覺，好吃又不遠，是在系館附近吃披薩的最佳選擇。"
  },
  {
    "title": "蘇草",
    "cx": 755,
    "cy": 1700,
    "description": "這間店其實不在118巷，在星巴克後右轉的路上。是一間裝潢漂亮有點像咖啡廳的小店。主要是賣好吃的義大利麵和鬆餅！雖然價格偏高（一個人約要200元），但也有比較便宜的選項，而且以大安區的物價，正常吃飯就動輒100元起跳下，這間店算是偶爾想要稍微奢侈一點的好選擇。"
  },
  {
    "title": "旭倉咖哩",
    "cx": 315,
    "cy": 1700,
    "description": "從系館往辛亥路直直走，過馬路後就在左手邊。因為離系館很近，很適合趕時間的時候吃。餐點大多落在 180 元以上，雖然價錢看起來小貴，但可以免費加一次飯和醬，還會送一杯紅茶（如果要去冰的話記得先跟他講），多人一起去可能還會贈送薯條之類的小東西，所以也很適合多人一起去吃飯。"
  }
]
  