{
  "yvchen": {
    "title": "陳縕儂教授",
    "mailto": "yvchen@csie.ntu.edu.tw",
    "website": "https://www.csie.ntu.edu.tw/~yvchen/",
    "author": "王政祺、毛翊蓁、林天行",
    "image": "/professors/yvchen.jpg",
    "content": [
      {
        "subtopic": "資訊系的學生除了資訊能力以外還需要具備什麼軟實力？",
        "answers": [
          "有一個最重要的是 presentation 的能力，除了口語表達以外，還牽涉到你要怎麼去組織報告的架構。如果沒有特別訓練過的話通常會比較偏向流水帳的方式，聽的人會覺得有點無聊。比較好的組織可能是去想像一個報告會有很多段落，段落之間彼此是平行的，將大 picture 先讓讀者知道，比較是結構式的，流水帳是自己很清楚，但聽的人不一定會有什麼感覺，要比較好記的話就是要給大架構，細節不記得比較沒關係。",
          "這件事情不是很容易，因為台灣學生從小到大比較沒有機會接觸，出國之後看到很多台灣學生跟國外學生的差異是包裝。國外可能可以包裝得非常 fancy，但台灣學生可能就只會平鋪直敘地講出來，但這卻是 presentaion 非常重要的技巧，可以透過一些 project 的 presentation 來練習等等。"
        ]
      },
      {
        "subtopic": "社交能力會是大學生需要具備的能力之一嗎？",
        "answers": [
          "我覺得是需要具備的。這其實要看工作性質，但因為大學就是希望能透過基礎能力的養成，來培養未來工作會需要的技能。而未來工作大部分會需要 cowork，要怎麼跟別人好好的討論、分配工作，其實很重要也蠻困難的。大家會發現如果兩三個人一起合作，常常會出現分配不均然後引起紛爭的問題，能夠趁大學的時候遇到這種狀況，然後思考如何排解是一件很重要的事情，而且在學校學習這件事的成本比工作低。"
        ]
      },
      {
        "subtopic": "想請問教授對新生的時間分配有什麼建議？",
        "answers": [
          "可以照自己的規劃！每個人對於每個部分所給的 priority 不一樣，例如有人想要出國唸書，那成績對他的 priority 就比較重要，那有些人可能覺得大學的時候找到可以交往的對象非常重要，每一個人本來就會有不同的標準，我覺得重要的是在一個特定的 priority 下，要怎麼適當的分配時間。"
        ]
      },
      {
        "subtopic": "教授建議學生可以如何在大一大二時找到未來專題研究的方向？可以如何準備呢？",
        "answers": [
          "系上開了前瞻資訊科技課程，這門課有一點像是讓大家用比較輕鬆的方式去了解每個教授的研究主題，一個學期可能會有六個老師，會帶大家了解各自的研究的方向，修了以後可能會得到一點感覺，也許不一定會發現自己最喜歡的領域，但至少可以找到自己不喜歡的。因為現在蠻多同學都提早修專題研究課程，所以算蠻適合同學的第一步。"
        ]
      },
      {
        "subtopic": "請問教授對於大學畢業就去工作的看法？",
        "answers": [
          "可以評估每一個人對自己未來的規劃，大部分我看到的 case 可能是做專題的時候覺得沒有那麼有興趣，也剛好拿到還不錯的 offer，或是公司給大學畢業生和碩士畢業生的 offer 大同小異。也有一些人可能是去公司工作後才比較清楚想要什麼，才又回來再念，或是在業界做得還蠻順利的。先去工作如果對於當下而言較好的話也很鼓勵。研究所可能很多人會覺得沒有興趣，那為什麼要唸研究所呢？研究所除了寫論文以外，還有很多不是做研究也很適用的。就像我前面說的 presentation 的能力，還有一塊是要怎麼尋找問題以及去看一些相關的論文，這些能力都是比較需要自己主動去規劃跟探索的，相較之下在大學這部分就會比較少一些。有可能大家剛去的時候不覺得自己有差，但後來就發現有研究所畢業的人那方面的能力比自己強。不能只看做這個研究或論文本身，因為軟實力其實才是更受用的，用到任何一個公司跟領域都是受用的。"
        ]
      },
      {
        "subtopic": "想請教授對新生說幾句話。",
        "answers": [
          "不要害怕！如果 programming 的第一堂課的成績沒有非常好的話也不要太在意，因為很多人也是第一次修都沒有修過，但後來把它好好修好後之後也是能夠很順利的！因為那門課其實是整個系上當人的比例最高的課，可以不用太悲觀或是嚇到啦～"
        ]
      }
    ]
  },
  "cmchou": {
    "title": "周承滿幹事",
    "mailto": "cmchou@csie.ntu.edu.tw",
    "website": "https://www.facebook.com/man.man.1848",
    "author": "王政祺、毛翊蓁、林天行",
    "image": "/professors/cmchou.jpg",
    "content": [
      {
        "subtopic": "通常新生可能會碰到什麼問題？可以如何面對並克服？",
        "answers": [
          "這題應該先問劉邦鋒老師 XD 。在寫程式上，可能你練了很久，但是得不到相對應的成果。對於這個問題，我覺得大家應該要不害怕去問同學，開始願意去跟同學發問、願意去問助教，高中那套只看著課本就會的方式是不適用的。大家一開始一定會碰到這個問題，多問就能比較容易上手。"
        ]
      },
      {
        "subtopic": "該如何平衡讀書以及社交？",
        "answers": [
          "首先要抱持著課業並不輕鬆的先決條件！不能覺得我上了大學就可以開始過著跟高中不一樣的生活，但是不用為了最後那一兩分而犧牲自己的社交活動。我比較建議大家把課業維持在一個你覺得可以的程度，然後把時間投入在其他活動。如果你覺得有一件事情是你離開校園後就沒有辦法去做的，那就去做！但是如果你在籌備活動或是參與活動的過程中，發現自己已經心力交瘁了，那就適度的去放鬆跟調整。"
        ]
      },
      {
        "subtopic": "建議大一新生有哪些事情是要盡量把握的？（ex. 計程修好、社交 ……）",
        "answers": [
          "我想應該是多參加系上活動多交朋友吧！同學是學習過程中很重要的夥伴，學程式與傳統高中學科很不相同，需要大量的練習及實作，埋頭自己學習是很難有效率的，所以計算機程式設計要學好之外，希望大家也要多參加系上活動認識學長姐跟同學，會很有幫助的。"
        ]
      },
      {
        "subtopic": "如果新生之後想要輔系、雙主修，在大一應該要先做哪些準備？",
        "answers": [
          "每個同學在入學前，一定都有想在大學做的事，可能是玩社團，可能是打工等等。我也鼓勵大家都嘗試看看，這都是一種良好的人生經驗累積！但當這些活動會開始影響到你的課業，或是身體健康時，就請要記得該取捨了。畢竟每個人都只有 24 小時，如何做好時間管理，在課業與其他事物之間取得平衡，也是大一新生必要的學習喔！"
        ]
      },
      {
        "subtopic": "如何評斷一門課要不要繼續修下去？",
        "answers": [
          "這個我非資訊專業無法給予實質建議，但還是要提醒每學期只能停修一門喔 ！（很重要！） 所以是哪一門就要好好去斟酌，當然最好的方式是，學期初就好好評估自己狀況，保留多點彈性，免得期中進退兩難。"
        ]
      },
      {
        "subtopic": "面對停修或挫折的心態調適？",
        "answers": [
          "挫折其實也是大學需要學習的重要功課，不要先急著否認自己，你們都相當優秀，請勇於詢問老師、學長姐、身邊同學！或許每個人面對的狀況或困難不盡相同，但從中應該可以找到適合自己的方法，你也會發現其實你不孤單，而這也是很重要的成長養分。"
        ]
      },
      {
        "subtopic": "想對新生說的話？",
        "answers": [
          "請記得要固定收 Email，我寄的信不要忽略！不要當垃圾信啦！還有最重要的一點，身心靈健康才是最重要的事，當你覺得喘不過氣時，歡迎隨時來找我聊聊，我都會很願意傾聽的。歡迎大家！期許我能成為你們信任的大姐姐～"
        ]
      }
    ]
  },
  "chusong": {
    "title": "陳祝嵩教授",
    "mailto": "chusong@csie.ntu.edu.tw",
    "website": "https://imp.iis.sinica.edu.tw/",
    "author": "曹紹洵、陳泰穎、廖禹喬、王褕立",
    "image": "/professors/chusong.png",
    "content": [
      {
        "subtopic": "教授認為高中跟大學的學習環境跟方向有什麼樣的差異，該如何調整自己的學習方法因應這些變化？",
        "answers": [
          "高中因為升學的競爭，學生可能會比較單純的為考試而學習，所以會非常注重要在各種考題上都能拿高分。大學當然也會有很多考試，但也會有別的學習的活動，比如程式的撰寫、或是各種系統、網路等等有關的操作，以及文獻閱讀和專題報告等；也不是說考試分數這些不重要，但這不見得是單一的，重點是你學到了什麼。而且現在的分數是等第制，其實有個比較大的範圍。而以教科書來說，高中的時候可能會通通上完，然後每個單元都去練習；但大學的時候就要看老師了，不一定會全部上完，可能會教到比較基本的三分之二，如果你有興趣可以自己再去鑽研後面的。",
          "每個科目的學習上，我覺得可以先求穩，然後再求好；把握自己本系的基本科目，有時候課業也都會有點重（笑），但至少可以穩固過關再慢慢讓自己去進步。有時候你在某些方面比較有天份，或是本來就有鑽研過，自然而然就會比較佔優勢；但如果你完全沒有接觸過，那可以多多參考前人的經驗。"
        ]
      },
      {
        "subtopic": "很多新生進入資訊系時，從未深入接觸過電腦科學領域，產生許多不適應，教授有什麼樣的建議嗎？",
        "answers": [
          "完全沒接觸過的話，比較建議大家要先求穩定，不要一下子就給自己太大壓力，覺得「我要做的跟強者一樣」。一開始是很不容易的，但你至少要讓自己都能至少過關。也因為有強者在，有時候同儕間互相地、不經意地聊個一兩句，觀念的提升就完全不一樣了。很多時候可以多去跟同學互相接觸，有的強者也是很樂於回答、解決問題的；或者你自己就是強者，這樣應該會碰到很多人想請你給他一些指點，而你也會發現自己能在教別人的過程中有所收穫。其實畢業後十年再看這些事情，就會有完全不一樣的看法；大家頭上各自都一片天，實在是很難分。",
          "再來是這樣高強度的競爭環境，一群人一起為寫程式、寫作業來奮鬥，這不是每個科系都有。這樣的同儕的學習的環境其實是很寶貴的，可能你們現在還不容易體會；在這種環境裡成長出來的人，我覺得不論一開始是一般人或是強者，以後都是很強的（笑）。",
          "不論你現在進來是什麼樣的狀態，至少先求穩定自己，然後再按步就班地進步。"
        ]
      },
      {
        "subtopic": "教授建議新生該如何安排大學課表，對於大一先修高年級的必修有什麼看法嗎？",
        "answers": [
          "我覺得大一大二的課，特別是有程式的課可能會重一些，要好好了解自己有沒有餘裕去修其他的課，因為至少自己本年級的課要先握住。如果想要先修一些高年級的課，一般的話會建議去修數學的課程；雖然都要花時間，但也許用腦的部位比較不一樣，比較能夠互相調劑一下。如果你只是想要讓自己趕快進步所以修了很多程式的課的話，到時候作業不容易趕出來其實也不好。但以上是針對原本沒有程式相關背景者，若自己本身已經在大一大二的課已經行有餘力，就可以比較自由的調配。"
        ]
      },
      {
        "subtopic": "教授認為新生該如何規劃自己大一生活，像社團、系隊、打工、愛情等許多活動，又該如何與課業做協調，有什麼事是大一要好好把握的嗎？對於上大學後的時間分配有什麼建議？",
        "answers": [
          "這個問題是蠻難回答的，很難有什麼標準答案。我只能講我自己經驗，因為不管你選哪一邊，另一邊就會有點遺憾。我以前大學時花比較多時間參加社團，而系上辦的一些活動、營隊什麼的我都沒有參加；他們那時候還去綜藝節目，我也沒有去，因為我主要都在社團。後來我就會覺得，如果再來一次有可能系上活動也多參加一點，但這樣社團活動就會少一點啊。反過來說，那你就試著讓自己不要後悔自己做的選擇，雖然可能會有些遺憾，但你在所選的事物裡會獲得一些屬於自己的東西。",
          "打工的話我覺得適當就好，如果經濟上有壓力的話可能沒辦法，但因為課業也滿重的，如果可以讓自己多一些不論是生活經驗、教學經驗、或是你未來想從事的工作的專業的經驗，我覺得都值得去嘗試。但是你這邊多花一些時間，其他方面就要犧牲一些。",
          "大一新生我覺得可以多方面都接觸一下，雖然你可能沒有特定的選擇，但是接觸之後，可能會發現在這麼多條路之中，你比較想以什麼做為主軸。過了很多年之後，我其實覺得選什麼都有他的好處，有利有弊，要看個人價值觀來做取捨。",
          "至於愛情他發生了就發生了，我以前同學也有很久都沒有女朋友、到碩士班了還在找我抱怨，可是現在小孩都已經……（笑），就是有人比較早有人比較晚嘛。畢業以後十年以後大家其實都差不多，要成家的都成家了，就只是時間的早晚而已。"
        ]
      },
      {
        "subtopic": "請問該如何在大學生涯中，尋找自己有興趣的領域呢？",
        "answers": [
          "系學會有一個介紹專題的網頁，有訪問很多系上的老師，你們可以先上去看看（編注：就是這個網站 XD）。再來系上有門課叫前瞻資訊科技，有點像系上的通識課，會有很多老師、每位老師講兩個禮拜，可以在裡面聽到很多不同的領域，也可藉此來發掘。現在資訊豐富，像 AI 的東西就天天在報導，如果看到有興趣的領域當然就可以直接去找看看系上的老師。",
          "大家也可以跟直屬學長姐、家族或是導師詢問，因為導師都有自己的研究領域；但是也可以問導師問說，針對你比較有興趣的領域有沒有什麼推薦、有那些老師可以去接觸。另外，大一有四位特別安排的大一導師，也可以跟他們詢問。"
        ]
      },
      {
        "subtopic": "資訊系學生去公司實習的風氣逐漸興盛，教授有什麼看法嗎？教授會建議學生大一、大二的時候就開始找實習嗎？",
        "answers": [
          "我不太建議大一大二就去實習，因為大一大二的必修課比較重，比較建議好好修課，先求穩再求好。大三大四就看大家自己的興趣，很多公司很歡迎本系的學生去實習，希望學生畢業之後就去他們公司，對學生來說也算是一種打工。",
          "我覺得你如果想去實習的話，要站在兩方面來看。一方面是你自己學習一些東西；另一方面是僱用你的這一方的方案。通常比較大的公司，就真的是讓學生來實習，其實也沒有期望學生真的要做出什麼貢獻，只是給你一個學習的機會；也有的公司會希望學生能真的做出一些成果。第二種你要負擔的壓力可能會比較大，這時候就要想想看你到底是單純想要去學習，還是你願意擔負更大的責任，培養一些實戰經驗。",
          "這個部分可以多問一下過來人的經驗。有些公家機關或是學術研究單位也有一些實習的機會，像是中央研究院的就會以研究生為主；而像資策會這些財團法人也會有一些實習的機會，有滿多的選擇可以考慮的。"
        ]
      },
      {
        "subtopic": "教授對於出國交換或留學有什麼看法，若有意願的話應該要做什麼準備？",
        "answers": [
          "我覺得各位同學可以先留意一下學校或是相關來源有沒有比較合適的計劃，像是我們系上有一些可以去國外交換的計劃案，各位同學可以留意一下相關的資源。也可以先接觸一下相關老師，例如某個老師跟這個計劃案比較有關，那麼當同學要出國交換的時候，這個老師可能就可以幫你寫推薦信。另外出國留學可能有一些選擇，大學的時候就交換、大學畢業的時候留學，或是研究所出國，這些都可以考慮看看。",
          "出國留學、交換很多時候都需要老師的推薦信，每個老師寫推薦信的標準多多少少會有點不一樣，但是如果你可以讓老師有印象，就可能比較有機會。例如修老師的課成績比較高，上課的時候常常發言，或是去當老師的助教，參與老師的實驗室，這些都是加深老師對你的印象的方法。",
          "另外，有一些系上的教授也有出國留學的經驗，例如目前四位大一導師都是有這樣的經驗的。如果同學真的下定決心的話，就可以考慮提早認真的跟這些教授諮詢一下。"
        ]
      },
      {
        "subtopic": "教授對於出國交換或留學有什麼看法，若有意願的話應該要做什麼準備？",
        "answers": [
          "我覺得各位同學可以先留意一下學校或是相關來源有沒有比較合適的計劃，像是我們系上有一些可以去國外交換的計劃案，各位同學可以留意一下相關的資源。也可以先接觸一下相關老師，例如某個老師跟這個計劃案比較有關，那麼當同學要出國交換的時候，這個老師可能就可以幫你寫推薦信。另外出國留學可能有一些選擇，大學的時候就交換、大學畢業的時候留學，或是研究所出國，這些都可以考慮看看。",
          "出國留學、交換很多時候都需要老師的推薦信，每個老師寫推薦信的標準多多少少會有點不一樣，但是如果你可以讓老師有印象，就可能比較有機會。例如修老師的課成績比較高，上課的時候常常發言，或是去當老師的助教，參與老師的實驗室，這些都是加深老師對你的印象的方法。",
          "另外，有一些系上的教授也有出國留學的經驗，例如目前四位大一導師都是有這樣的經驗的。如果同學真的下定決心的話，就可以考慮提早認真的跟這些教授諮詢一下。"
        ]
      },
      {
        "subtopic": "您覺得資訊系的學生除了資訊能力以外還需要具備什麼軟實力？",
        "answers": [
          "表達能力很重要：當你懂了某個東西以後，要怎麼樣清楚的把他說出來？在高中也許不是那麼強調「說」，但是在大學階段我覺得應該要好好培養這樣的能力。有的時候你甚至可以從講給自己聽開始，當你學東西到一個進度、覺得自己了解了一些東西後呢，你可以想想看要怎麼講給人家聽比較容易懂。有時候這種方式也會影響自己的思維，知道在腦中怎麼整理知識，讓自己也比較容易吸收。這種理解有時是沒有辦法在初級就發生，但你可以不斷的去思考怎麼表達才會最清楚。",
          "在一個團隊裡面會有人扮演強者的角色，也會有人提供另外一種實力，比如說是領導能力，或是寫報告的能力。如果是創業的話，也會需要有人負責溝通、取得投資，進行業務的推展。要培養這一方面的能力，也可以考慮修其他系的課、或是輔系，行有餘力的話可以培養自己第二個專長。"
        ]
      },
      {
        "subtopic": "想請問教授在這幾年的教學經歷中，有沒有注意到我們這個世代有什麼特別有趣的現象，或是對我們這個世代有什麼建議之類的？",
        "answers": [
          "不一樣的地方我可能要想一想，因為我比較沒有觀察這部分。我可以反過來回答另外一個部份：我覺得無論哪個世代，都好像都不太會問問題。我教的比較多是研究所的課程，有遇到過學生很會觀察、詢問，透過回答他提出的問題，老師也比較能夠了解大家聽到這裡，會有什麼樣的疑惑或是產生怎樣的回饋。可惜大部份的時候，都沒有什麼人想要提問。"
        ]
      },
      {
        "subtopic": "現在有許多系都有程式設計這門課，想請問教授資訊系的學生在這方面有哪些差異和優勢呢？",
        "answers": [
          "我覺得我們程式設計的課，跟其他系最大的差異是強度。其他系開的課也叫程式設計，但是我們資工系對學生的教學強度和整個作業的難度，還有真強者這些文化，這些情況都是不太一樣的。別的科系的程式設計課和資工系相比還是有一點距離，假如別系的學生申請轉系或輔系，當他們修了我們的程式設計，就會知道強度是有差的。"
        ]
      },
      {
        "subtopic": "請問教授學生平時除了修課之外，該如何自學打好基礎呢？ ",
        "answers": [
          "看你是想要哪一方面的自學。如果是課業專業有關的，我會建議行有餘力的人去申請雙輔修，因為也不乏有人藉此建立第二專長。興趣的部份，可以參加個社團去學，例如說你對合唱有興趣，那就去參加合唱團；可以的話，我覺得還是跟大家一起學比較容易。",
          "很多時候有些事學校沒有教，就要自己靠搜尋去自學。以 AI 為例，現在到處都有人樂於教學，甚至有些高中生就在自學 AI；鑽研的比較深之後也可以去看頂尖的論文，那些論文你怎麼追也追不完。現在這種網路搜尋的時代，任何領域都有兩個高峰；很會搜尋又很專注的會在前面的高峰，和其他人會拉開差距。"
        ]
      }
    ]
  },
  "ctliang": {
    "title": "梁啟德教授",
    "mailto": "ctliang@phys.ntu.edu.tw",
    "website": "https://web.phys.ntu.edu.tw/semi/ceos/general.htm",
    "author": "曹紹洵、陳泰穎、廖禹喬",
    "image": "/professors/ctliang.jpg",
    "content": [
      {
        "subtopic": "教授認為高中跟大學的學習環境跟方向有什麼樣的差異，該如何調整自己的學習方法因應這些變化？",
        "answers": [
          "高中屬於義務教育階段，著重於各層面基礎知識的學習與養成，可以透過修習不同科目去發掘自己擅長與有興趣的領域。而到了大學，更多的是在自己的專業努力，但也不要忘了看看旁邊的世界，也許會在其他領域得到意想不到的啟發。普通物理對於資工系而言還是一門必修，有一些東西即使同學們的將來不一定會直接用到，但是這些知識可以幫助你了解一些自然現象，或者是解釋一些日常生活上的問題。例如電磁學或量子物理的部份，更是可能對各位未來的專長有所幫助。所以我想告訴各位，畢竟這門課就是必修，希望大家能夠花一些心思想辦法了解這些課程。",
          "除此之外，大學生活很自由，需時刻提醒自己做好該做的事，不要迷失了自我。"
        ]
      },
      {
        "subtopic": "您認為學生們可以怎麼強化自己主動學習的心、平常要多了解一些科學上的發展之類的具體的作為？",
        "answers": [
          "各位有聽過 LK-99 嗎？物理學上有很多比較尖端的研究領域是瞬息萬變的，很多新東西都會突然跑出來，像我有位同事就做了跟這個 LK-99 材料相關的直播。當然很多物理上的新東西不一定會直接和資訊工程有關，但是我覺得還是要關注一下。有些知識是課本不一定會講到的，比如說：普朗克常數的定義，造成了公斤的定義和從前完全不一樣，我上課的時候也會補充（編按：2019 年 5 月 20 日，公斤由原器改由普朗克常數定義）。即使到現在，就我所知，課本都還沒有提到。但是這是很重要的事情，因為普朗克常數從此被定義為一個 exact 的數字，經由普朗克常數會推到公斤；大家平常比較難想像微觀的東西會推到巨觀的東西吧。"
        ]
      },
      {
        "subtopic": "普通物理學為不少大一新生害怕的科目，請問教授對於修習此門課有什麼建議與想法呢？",
        "answers": [
          "大學普通物理跟高中物理最大的差別在於，高中物理著重於定性的描述，而大學普物更多的是如何定量的計算，也有一些重要公式的推導。當然在上課的過程中，我們還是會從比較基礎的部分開始講解，我也許第一堂課會大概了解大家的數學到底到哪個程度。如果有同學是比較基礎的部份有點困難，譬如說 sin 的微分是 cos，cos 的微分是-sin，如果有人不熟悉的話，我就再講解一次就好了，相信前面幾次課程大家的程度就會慢慢跟上了。只要專心聽課、好好複習，遇到有不太理解的地方就舉手發問，普物不是一門太困難的課程。狹義相對論可能是會對同學比較困難的部分，但我們已經有影片可以供同學反覆思考與學習之用，希望大家可以多花一點時間。"
        ]
      },
      {
        "subtopic": "教授建議學生可以如何在大一大二時找到未來專題研究的方向？可以如何準備呢？",
        "answers": [
          "系上開了前瞻資訊科技課程，這門課有一點像是讓大家用比較輕鬆的方式去了解每個教授的研究主題，一個學期可能會有六個老師，會帶大家了解各自的研究的方向，修了以後可能會得到一點感覺，也許不一定會發現自己最喜歡的領域，但至少可以找到自己不喜歡的。因為現在蠻多同學都提早修專題研究課程，所以算蠻適合同學的第一步。"
        ]
      },
      {
        "subtopic": "教授認為在學習物理學對於在資訊領域的探索有什麼幫助呢？",
        "answers": [
          "生活中的種種現象往往與物理息息相關，未來學生如果希望使用程式模擬現實系統，有許多的環境因素需要考慮，而這些環境參數也許就遵循了某種物理定律。而即便將來工作沒有用到太多物理相關知識，但大學課程往往也不光是只專注於自己的專業，探索其他各式各樣的領域也許能夠得到更多的啟發。特別是最近當紅的量子電腦就一定需要量子力學的知識來了解，例如量子位元這些知識，資工系應該是不會置身事外的。以量子位元而言，我們也許沒有時間去講解這麼的多，但是基本的自旋、量子的本質這些內容，例如薛丁格的貓（同時是生與死的疊加狀態），我們一定會在下學期接觸到。另外以相對論而言，各位同學可能沒有辦法想像 GPS 要做到這麼的精準，會需要考慮到相對論導致的時間膨脹等等因素，所以普通物理可能會比同學們想像的還要重要。我可以理解資工系學生可能會覺得普通物理說不定不是這麼重要，但是就像我們剛剛提到的種種例子，有基本的量子、電磁學知識的話對於將來發展是會有所幫助的。"
        ]
      },
      {
        "subtopic": "教授期待來修習普通物理學的學生應該具備什麼能力、特質？",
        "answers": [
          "最主要學生要有一定的微積分基礎與清晰的邏輯分析能力，普物為高中物理的進階，但由於課程安排，所有的課程內容都會重新開始授課，即使高中物理沒有學得非常好，只要認真聽課、回家作業認真思考，也絕對能夠輕鬆通過此門課程不必太過擔心。除此之外，我覺得各位至少要有願意思索問題的能力。我比較害怕的是有一些學生會希望我直接把東西都丟給他，然後他不願意思考，這會是讓我比較擔心的學生。在數學的部份，我會在開學時了解大家數學的程度再作調整。"
        ]
      },
      {
        "subtopic": "有注意到教授在上個學年是教化工系的普通物理學甲，因為上個學年的大一新生為 108 新課綱的第一屆，想請問教授對 108 課綱的學生有什麼想法，可以給今年的大一新生作為參考的？",
        "answers": [
          "新舊課綱的差別其實不大，學生只要好好充實自己、把該做的做好，絕對能夠適應這個瞬息萬變的時代不用擔心。另外，就像我剛剛所提到的，我不會假設大家什麼東西都會。我會稍微問一下一些比較基本的知識點，但如果真的有人不會，我會建議他要在課堂上面提問，否則只有考試來了我才知道他不會寫，那就有點太遲了。我會建議各位同學，如果真的不懂要講，不要不好意思問。不過有些比較基本的東西，比如說 sin、cos 的微分，真的不懂的話要問，我就會花點時間來把這部份的內容再帶過一遍。沒有愚蠢的問題，只有愚蠢的答案。除此之外，各位高中的課本也可以先留著，說不定有些不清楚的部分，可以回去看一下。"
        ]
      },
      {
        "subtopic": "想請問教授在這幾年的教學經歷中，有沒有注意到我們這個世代有什麼特別有趣的現象，或是對我們這個世代有什麼建議之類的？",
        "answers": [
          "在這個資訊化的時代，可以發現有越來越多的學生使用筆電、平板等科技產品輔助學習，在課堂上也會看到許多學生使用筆電、平板來紀錄上課內容和寫筆記。但這些科技產品往往除了學習，還能夠看影片、玩遊戲，學生使用科技產品上課須不被這些外部因素所誘惑，不然適得其反，收穫更差的學習成果。我希望大家用電腦就專心看投影片等教材、作筆記就好，不建議做別的事，否則還不如不要來上課。現在資訊非常多，基本上如果有什麼東西你不懂，直接 Google 就好，面對這麼充足的資源，希望同學要好好利用這些科技，成為幫助自己的工具。"
        ]
      },
      {
        "subtopic": "教授還有想跟新生說的話嗎？",
        "answers": [
          "大學生活多采多姿，除了認真學習外也要好好體驗大學生活，不要四年過後才來後悔，也要注意，雖然大學很自由，但如果被當導致需要重修反而得不償失。另外，課本、上課投影片、期考題目都是英文的，各位同學還是需要有基本英文能力喔。"
        ]
      }
    ]
  },
  "hsinmu": {
    "title": "蔡欣穆教授",
    "mailto": "hsinmu@csie.ntu.edu.tw",
    "website": "http://www.csie.ntu.edu.tw/~hsinmu/",
    "author": "黃俊翔、毛翊蓁、林天行",
    "image": "/professors/hsinmu.jpg",
    "content": [
      {
        "subtopic": "許多新生剛進來時沒有程式相關背景，進來後才發現身邊有許多所謂的「強者」，想請問教授對於學生在心態和學習方式上可以怎麼去調適？",
        "answers": [
          "其實根據我的觀察，剛入學的同學有很大一部份是不會寫程式的，但經過系上許多課程的洗禮，只要大家都有足夠的努力的話，能力和入學時就有豐富的程式基礎的同學並沒有太大的差別，在其他專業技能的發展上也差不多是如此。",
          "心態方面的話，也不用覺得一些人就是神、一些人就是小弱弱這個樣子。以我自己的經歷來說，數學是我比較弱的一環，那系上有很多很吃重數學的課程，當時在修這些課的時候就很需要身邊的大神們給我一些提示，總覺得自己就是要依賴這些大神才有辦法過關。",
          "但後來到國外念書，人生地不熟，也沒什麼人可以一起討論作業，一切都要靠自己，談白講過的真的很痛苦，但後來也因此發現我自己其實也可以處理那些我自己覺得不擅長的數學課程，也可以取得還不差的成績。",
          "所以我想鼓勵新生，相信自己是可以獨當一面的，有時候可以把大神當成一種虛幻的存在，雖然他們可以給你一條捷徑、帶你解決大部分的問題，但要學習的人終究是你自己，非必要的時候不要太依靠神明的力量，我們還是要靠自己，才能有所成長。"
        ]
      },
      {
        "subtopic": "教授對於學生上大學後課內、外的時間分配有什麼建議，像是要如何在各種活動中找到平衡呢？",
        "answers": [
          "我在DSA課程中有一個軟體工程相關的影片叫做 evidence based scheduling，我這裡稍微提一下這個概念。這個概念其實很簡單，就是要對自己完成事情的時間有所掌握。大學階段往往是大家第一次得到掌握自己大部分時間的權利，我們需要務實地去想，有哪些事情要做、這些事情又需要花費多少時間、優先度又是如何，如此一來我們才有辦法做一個有意識的選擇，這是大家過去比較不習慣的事情。",
          "所以我覺得最重要的就是要妥善的規劃自己要完成的事情、並做出取捨，看是要每周做或是以學期為單位都可以，建議大家都可以開始練習做選擇以及估計自己的時間。"
        ]
      },
      {
        "subtopic": "想請問教授，您覺得資訊系的學生除了資訊能力以外，還需要具備哪些軟實力？",
        "answers": [
          "第一點，就是要好好說話，這裡的好好說話指的是把自己想表達的事情，完整且有邏輯的好好表達。我在教學生的這些年，我最大的困擾就是同學們常常在發表一些成果時，跳過了許多他認為大家都該知道的知識，那聽眾自然就會一頭霧水、甚至低估你所做出的結果，這會是非常可惜的一件事。我建議同學可以在日常生活中慢慢練習，像是跟同學討論作業時，不要假設對方會自行腦補，把對方當成這個領域的初學者，完整、清楚的敘述。",
          "第二點就是要過均衡的生活，這件事情的出發點是常會有學生表示自己不知道要怎麼好好地跟別人聊天，深入了解後會發現他們的休閒活動會過度單一，缺乏廣度的攝取，那如此一來自然地就很難跟別人有可以引起共鳴的話題，也比較難去理解他人的感受，這一點是需要有意識地嘗試以及練習的，雖然這段有些非傳統，但我認為這是生活中很重要的一環。",
          "除此之外，也希望大家能更加注重電子世界的禮節，像是現在很多學生都把電子郵件當通訊軟體用，寄了一封沒頭沒尾的信件，我連寄件者是誰都不清楚了，當然就很難做回覆了。"
        ]
      },
      {
        "subtopic": "想請問教授對於大一新生有什麼建議，才可以讓他們在大一下的時候能更好地面對資料結構與演算法這門課呢？以及大一新生在這堂課常會遇到的問題？",
        "answers": [
          "首先就是心態上要準備好，當你在成長過程中踏入下一個階段的那一個剎那，看到更高等級的戰場的這種衝擊感是很強烈的，心態上要準備好、要知道受挫會是一個常態，你會一直感受到甚麼都做不到的無力感，但要記得這是成長的過程，要試著去接受它。",
          "接下來呢就是要準備好充足的時間，修這門課的時候記得不要把時間塞太滿，我以前也是這樣的人，把很多事情通通包下來，然後全部炸開。這樣做雖然有它正面積極的地方，但也有可能把自己弄得很慘。所以，在修這門課之前，把時間、心態都要準備好，剩下的就是不要輕易的放棄了。",
          "最後一點是要給那些比較跟不上的同學。DSA （資料結構與演算法, 大一下必修）可能不是大家都能修一次就過關的課程，有些人可能會覺得為甚麼要這樣折磨學生，但就結果論而言，不論你有沒有修完這門課，都可以在其中學到東西，終究是成長了。希望大家修不過也不用太著急，反正教授也不會跑走，耐著性子慢慢修總是會過的，最怕的就是自我放棄，覺得自己甚麼都不可能完成。",
          "順帶一提，因為這些課程都有所謂的傳統在，我們會希望大家在經歷了各教授的圍毆之後，你就有台大資訊系要求的水準在，保有台大資訊系的品質水準對我們來說是很重要的，也因此希望大家可以堅持下去、不要放棄。"
        ]
      },
      {
        "subtopic": "請問教授建議學生如何在大學生活找到自己有興趣的領域，以及培養專業能力？",
        "answers": [
          "我自己是覺得，想辦法多去利用自己所學到的東西來解決日常發現的問題，很多同學會覺得可以去做專題、去實習，這些方法固然很好，但我覺得最關鍵的地方在於照著自己的想法、找出自己要做的事情以及該解決的問題，這跟專題以及實習可能是照著別人的意思做事還是有點差別的。",
          "我自己努力作為這方面的實踐者，像是 NASA 團隊（系上維護工作站與網路服務的團隊）、以及 NTU Cool （台大的課程網站）就是因為覺得舊有的制度以及設備等等不夠便利因而誕生的。舉更多相關的例子、像是 NTU Cool 調整影片速度的插件、把 Ceiba （台大老舊的課程網站）系統上的資料打包的工具等等，都是同學自己發起而完成的，是從問題一直演進到解決方案的完整過程，這些事情雖然辛苦，但你會發現從中可以獲得很大的成就感，因為真正有人因為你的技術而受惠。",
          "除此之外，將原有的興趣與所學結合也是很不錯的，尤其現在結合人工智慧等科技往往能產生意想不到的點子，像之前就有人利用深度學習來隨機產生動漫頭像，所以我覺得像這樣更生活化一點，可能是比較適合大家的一個出發點。"
        ]
      },
      {
        "subtopic": "請教授發表一下對出國唸書 / 留在國內升研究所的看法？",
        "answers": [
          "就出國來說，現在大部分同學出國的目的都是念碩士，接著在國外找工作，和念博士然後進入研究領域，我覺得是兩個不同的路徑。跟在台灣不同，在美國這個系統是這樣：大學畢業後，如果你想工作就直接去，其實不需要念 CS（Computer Science） 的 master（相當於台灣的碩士），想要研究就直接念 CS 的 Ph.D，也不需要念 master，美國大部分的碩士班反而是用來設計給大學部不是念資訊科學，但未來想走這方向的人。如果你是要出國做研究，那其實大學畢業就可以去申請博士班了。",
          "可是並不是所有人都適合，有些學生他準備好了，包含語文能力、對生活的適應能力、履歷表，畢竟博士生的錄取是很困難的一件事，相較於來自全球各地的其他申請者，大部分大學部的學生畢業時不會有很好的履歷，所以如果大學畢業想去申請美國好的學校的 Ph.D，大部分的大學生是做不到的。但是少部分的學生是做得到的，如果在大學的時候有繼續跟教授做專題，有些論文的發表，累積很好的一些研究經驗。其實我也是在台灣念完碩士之後才出國念書的，碩士有一個優點就是讓你對研究領域有比較深入的了解，有更長的時間讓自己準備好，特別是碩士以研究為主，你一定會累積比較多的研究經驗，可以幫助你申請到好的博士program，如果你想出國念碩士然後工作，那就要看你的經濟能力了，其實我有學生念完碩士出去工作了 3~5 年再到美國念碩士、 program，如果你想出國念碩士然後工作，那就要看你的經濟能力了，其實我有學生念完碩士出去工作了 3~5 年再到美國念碩士、工作，有些人在台灣工作之後發現到國外工作會更符合他想做的事，才決定出國，這個時間點不是早做就比較好，想清楚再去做就是了。"
        ]
      },
      {
        "subtopic": "想請問教授，現在許多課程都轉成大班教學、線上授課，教授對於這樣的趨勢有什麼樣的看法，以及對學生的改變如何呢？",
        "answers": [
          "這個大概可以講個三天，因為我個人就是大班授課的倡導者以及施行者，學校的立場暫且不提，我們從學生或是老師的立場出發，因為大班制下，助教的資源會比較多，這樣學生比較容易即時的得到助教的協助，能有一種被支持的感覺，我覺得這樣可以減緩許多前面所提到的，踏入下一階段的衝擊感。",
          "另外就是活動的部分，我很喜歡在課堂上參雜一些活動，有時候要能夠好好的吸收課堂的內容，和你們對於那門課的興趣是高度相關的，你只要對那門課有所期待，就會更願意去認真的去嘗試吸收裡面的內容，這些是我希望達成的效果，而有助教的幫忙才可以更好的推動這些活動。"
        ]
      },
      {
        "subtopic": "教授認為高中跟大學的學習環境還有方向有什麼差異，新生應該如何調整自己的學習方法，去面對這些變化？",
        "answers": [
          "總而言之就是：不要為了考試與分數而活，儘管上了大學，還是有很多地方是需要用到成績的，但實際上分數在這一塊的重要性已經慢慢地降低了，現在會更重視你完成了甚麼樣的事情、有甚麼樣的能力。",
          "有很多同學在大學依然過著讓分數最佳化的生活，對課程就只是為了拿到高分、淺嚐輒止，而沒有看得更深，我覺得是非常可惜的。雖然要做出調整需要花一些時間，畢竟台灣人與分數的羈絆非常深，即使是我們當老師的也有很多業務指標等等的要去注意，但唯有我們有意識的嘗試去做調整才有可能會改變。"
        ]
      },
      {
        "subtopic": "想請問教授在這幾年的教學經歷中，有沒有注意到我們這個世代有什麼特別有趣的現象，或是對我們這個世代有什麼建議？",
        "answers": [
          "第一點就是現在的學生好像不太喜歡翻書，平均而言，大家比較難長時間的耐著性子去做一件事情，現在大家都很習慣上各式影音平台、從影片吸收知識，我個人是覺得有點可惜，因為書本對於知識的整理是比較強的，也比較容易引入較深入的知識，當然影片也有很多好處，我也看了許多，但我覺得找到其中的平衡是很重要的。",
          "還有就是現在的學生比較會去對現有的體制表達不滿，那這件事情有好有壞，正面的地方在於，大家會去關心自己的權益，知道自己想要甚麼，並試著把這個社會引導向自己理想的那個方向，這是有其正面積極的意義的；但從另外一個角度來看，這些不滿往往流於抱怨而缺少一些有建設性的解決方案、或是沒有考慮背後的原因以及複雜之處，我覺得這很可惜，希望大家不要停止抱怨，但是後續的配套可以做得更完整，多去了解問題、思考好的解方。",
          "最後再補充一點，老師其實很需要學生的正面力量，大家在提出對於體制的不滿時也可以多鼓勵老師們做得不錯的地方。畢竟老師也是人，這些負能量持續累積，終究會失去做更多的動力。所以，多給助教跟老師一些正向的話語，相信對整個大環境會是一件很好的事情。"
        ]
      },
      {
        "subtopic": "教授還有想跟新生說的話嗎？",
        "answers": [
          "疫情對大家而言都是一個很難過的關卡，對老師而言就是要多去學習一些直播的工具，那對學生來講就是要去學習更有效率的學習方式，會更著重在自主性的部分，總之我希望能鼓勵新生要做自己的主人，去決定自己要如何地規劃、如何的學習，因為在這樣的時代下，我們更沒有辦法去輕忽這些決定的重要性。"
        ]
      }
    ]
  },
  "sehuang": {
    "title": "黃上恩教授",
    "mailto": "sehuang@csie.ntu.edu.tw",
    "website": "https://tmt514.github.io",
    "author": "劉蕃熙",
    "image": "/professors/sehuang.jpg",
    "content": [
      {
        "subtopic": "教授對於新生該如何安排課表有什麼建議，對於大一先修高年級必修有什麼看法？",
        "answers": [
          "系上有規劃各年級課程，有某種程度的連貫性，會以台灣高中生的程度評估。不過，推薦對自己能力有掌握，且了解高年級課程，有把握的同學可以試試看。但是這樣的「越級打怪」也會有風險，如果在期中時發現自己的腦力與體力負荷不來，導致需要停修或是成績不符合理想，或是無法平衡生活，可能會讓自己的自信心下降，造成惡性循環。因此，同學們應該要在選課時就仔細評估自己是否能負荷，並且先想過發生無法負荷等情況該如何應對，這樣的話會比較合適。"
        ]
      },
      {
        "subtopic": "很多新生進入系上後發現周圍有許多「強者」（高中有比程式競賽的人），想請問教授認為沒有程式背景的同學應該如何與所謂的「強者」學習與互動，才能達到雙贏的局面? 另外，無基礎的學生在面對程度遠超前他們的強者時，該如何調適心態？",
        "answers": [
          "強者有很多種，有些人是從高中知道自己對資訊有興趣，就可以提早準備，這是一條大家比較看的到的路，但其實有更多的是其他領域的強者。",
          "沒有基礎的同學看到厲害的人可能會沒有信心，但那些所謂的「強者」在剛開始學的時候，一定也有經歷過這些挫敗。看到有些人比較得心應手時，可以問他們是怎麼想到的，同學通常都會願意回答。",
          "另外，在不同的知識背景下，你們對問題的見解與表達方式可能會有差別，當討論到有情緒的時候，請意識到帶有情緒的討論往往會加深誤會，試著以理性討論才能有有效的溝通。"
        ]
      },
      {
        "subtopic": "針對畢業後應該出國唸書、繼續在國內升學，或是先工作幾年再繼續升學，教授有什麼建議呢？另外，教授認為讀研究所對工作上的幫助有什麼？",
        "answers": [
          "每個時代都不太一樣，這幾年有些風氣是大學畢業就進入業界工作，這樣很好，可以提早接觸實戰經驗。相對來說，研究室訓練自己做一個比較嶄新，沒有探索過的東西，是對於人類知識前緣的突破。有些非常要求技術、大規模的工作可能會要求具備研究所的能力，這部分也是讀研究所的好處。",
          "而對於要不要出國的部分，這是很個人的，會與你在大學四年時進行的人生規劃有關，可以多參考同學、學長姐、老師的想法。",
          "先工作幾年再繼續升學，有好有壞。好處是先了解業界是什麼樣子，在遇到無法在業界中討論的問題時，或發現自己有缺了某塊經驗，非常適合再去念研究所，更了解自己要什麼。壞處是就沒辦法賺錢（笑），也沒有一定要怎樣，橋到船頭自然直。"
        ]
      },
      {
        "subtopic": "教授認為同學應該要如何發現自己感興趣的領域，對於尋找專題研究的方向應該如何努力呢？",
        "answers": [
          "若你知道自己對某個領域有興趣，你會在不知不覺當中 follow 這個領域正發生什麼事，默默地越學越深，之後找專題時就可以找對應的老師。",
          "但我覺得，如果你們進的實驗室與自身興趣不符也不用擔心。很多時候，一個研究做到一個地方，會需要其他領域的 insight 才能解決問題，或發現沒想過的問題，資訊領域很多概念是互通的，若是把這個經驗當作衡量以前的課有沒有學好的指標，也是一種很好的動力。",
          "對於如何尋找有興趣的領域，我認為可以去觀察各大資訊領域期刊與會議、美國電腦協會(ACM)裡有哪些領域的分類，或是瀏覽各教授之研究主題及開設的課程，找到感興趣的課名時，去看看課程內容、在生活上的應用，思考是不是自己喜歡的，這些都是發掘興趣的方法。當然，你也很有可能在工作後發現自己更有興趣的領域，那時再換跑道也沒關係。"
        ]
      },
      {
        "subtopic": "教授認為該如何規劃自己的大學生活，像是課業、打工、社團、愛情等應該如何分配與管理時間？",
        "answers": [
          "每個人有不同想法。以我自己的經驗，我們做理論的，從想要想清楚一個問題，到想清楚，可能花很多時間，而壓縮其他時間。管理時間是重要的，我認為大致的框架是需要「意識到」你有事情需要完成，有大概的時間觀念在，並要確保你有一直進行思考，想做的事情可以在大難臨頭前解決，最基本的底線是不要造成周圍其他人困擾。在這個框架外是很彈性的，也要注意到（生活上的）其他部分會花到時間。"
        ]
      },
      {
        "subtopic": "對於資訊系的學生，教授認為那些是我們必須有的能力？",
        "answers": [
          "我認為最重要的是願意動手嘗試、解決問題的能力：別人說的話不一定正確，因此動手實際驗證，或去測試有沒有更好的方法，這樣把心中所想的東西實作出來的能力是很重要的。",
          "同樣重要的是技術底子：經過四年的資訊系教育，你們不只要懂技術，還要了解後面的原理，如此遇到問題時才能知道如何解決。有深厚的技術底子也會讓你比較有自信，這樣做什麼事都會比較順暢。",
          "最後是表達能力與合作能力：資訊系大部分的必修科目比較偏向在培養個人實力，但若要走到業界，絕大多數都是團體戰。要把你自己了解，但別人不會的東西傳達出來，才能領導大家一起往前衝；或者我們也常需要向別人推銷自己的想法、說服別人這個想法是好的，這時表達能力就格外重要。"
        ]
      },
      {
        "subtopic": "想請問教授是如何決定要往學術界發展呢？是透過大學時參加的實習、研究嗎？教授當初有想過先去做幾年高薪的工作累積資本，再去學界嗎？",
        "answers": [
          "我大學時實習風氣不太盛行，比較幸運是我拿到 ICPC 獎牌，因此得以在大二暑假實習。後來到大三大四做了專題，老師給了我一篇論文慢慢看，但我沒有什麼想法，那時意識到自己智力不夠，發現一些未來在研究中可能會遇到的困難。",
          "在碩一升碩二的實習時，我過得非常開心，也因此拿到 offer 時很掙扎。但後來研究討論出突破點，老師說有機會申請博班，在這個時候我才放棄了offer。後來在博班也申請多次實習，有很多收穫。但相對理論研究就做不出來，導致壓力很大，再次陷入掙扎。",
          "決定不去（業界的）關鍵，一部份是因為公費留學規定我需要回國一段時間，另一方面是在美國走理論方面的學術研究免不了要教書，那不如回台大教。另一方面，我覺得我在碩博班學到的東西，更適合用在大學基礎課程中，那回來教書不失為一個好選擇。會建議同學，當你看到真的有一個想要看到他被解決、你真的很好奇的問題，那就是可以往學界發展的指標！"
        ]
      },
      {
        "subtopic": "最後請教授對新生說幾句話。",
        "answers": [
          "大學這四年應該會是最能影響你以後待人處事方法的人生階段。除了學習知識發展出你的專業以外，請不要放棄思考，找出你人生的目標。這件事情可能很累或很花時間，但是大學這四年的時間是相對充裕的。請不要害怕去尋求協助。相對地，在行有餘力之時，請想看看有沒有自己能幫得上身邊的同學們，並且回饋給幫助你的人的地方。在學習某些課程的時候，可能會下意識地不想寫某些作業，這可能代表你對這個領域在潛意識裡面比較沒有興趣，也可能只是感興趣的時間點還沒到。認知到了這點以後，可能就會比較釋懷了，也能夠比較理性思考自己接下來想怎麼做。最後，祝大家能夠享受大學的時光，活出屬於自己精彩的四年。"
        ]
      }
    ]
  },
  "cyy": {
    "title": "莊永裕教授",
    "mailto": "cyy@csie.ntu.edu.tw",
    "website": "http://www.csie.ntu.edu.tw/~cyy/",
    "author": "曾翊綺、曾顯恩、林方綺、王品翔",
    "image": "/professors/cyy.jpg",
    "content": [
      {
        "subtopic": "教授認為新生在打工、休閒、愛情、社團等等課外活動該如何選擇，那些事情一定要把握？",
        "answers": [
          "盡量跟上，或者說要加倍努力！我以前念資訊系的時候，大部分同學都沒程式背景，那時的狀況可能反而相對好，因為大家的出發點都差不多。我想現在同學擔心的是會有真強者或大神在。不過基本上他們就是起步早，一開始程式的表現當然比較突出，但要對自己有信心，如果有興趣，認真學習，一定可以達到一定的能力。反過來講，如果你認真學習卻還是離及格很遠，就要稍微思考一下，我相信大部分同學如果努力都可以達到一定的水準。",
          "當然興趣勉強不來，如果發現自己對程式不是很有興趣，我覺得也不用勉強，如果發現這不是你想要的，輔系、轉系、轉學都不是什麼不好的事情。最重要的是，首先你要努力嘗試過，確認這是不是你真的有興趣想學習的。",
          "我相信如果這真的是你有興趣要學習的，以同學的能力一定不會有問題，要有信心。難免會有 10 % 的同學發現這不是你想要學的，但資訊系寫程式不是全部，說不定佔不到一半，計算的思維、解決問題的能力也很重要，程式設計只是實踐的一種方式。你對程式沒有很有興趣，說不定會對後面的——比如說：對演算法設計、計算生物——有興趣，那可能還是值得你念資訊系，即使是這樣，你還是要對程式有一定的能力，不能完全不學，可是你不用讓自己變大神。",
          "說老實話，大部分系上老師的程式能力可能也未必比得上系上的大神，可是我們有這些領域的知識。所以分成兩個層面：你要知道資訊科學有很多面向，如果你可以 match 到一些面向是有興趣的，那就值得念資訊系；但如果你真的發現大部分的面向都不是你有興趣的，那應該要思考怎麼找到自己有興趣的，然後到正確的地方去學習。再來就是，程式的部分，重點是你要下苦功，練習可以讓你到達一定的程度，不過我一直覺得程式跟藝術一樣，有時是勉強不來的，有人就是有這樣的天分，很容易到達很高的地方，不過一般人經過努力的練習和按部就班的學習，都可以到達相當好的水準。如果可以到達那個水準，我覺得也就夠了，可是重點就是：第一個你要確定你有興趣，第二個你必須要願意投入時間去做練習。寫程式就像寫數學難題一樣，有時候你想到一下子就解決了，你沒想到，拖一個禮拜都解決不了，這個也是你必須去習慣、去面對的。"
        ]
      },
      {
        "subtopic": "現在有許多系都有程式設計這門課，想請問教授資訊系的學生在這方面有哪些差異和優勢呢？",
        "answers": [
          "我覺得這會從資訊系的整體規劃來看。如果只單就學習一個程式，那也許差距不大，可是要寫一個好的程式，通常你要有的知識不單單只是程式本身。如果你對編譯器、系統有了解，你可能會比較知道如何寫一個好的程式；如果你對演算法有了解，你可能會知道如何去設計一個好的、有效率的方法；如果你對電腦的底層有了解，你可能會知道如何讓你的程式執行的更快。資訊系的訓練不單只有程式設計，我想資訊系的學生長處在於，其他課程的輔助會讓你對於程式有更深入的了解，你知道這個程式是怎麼樣被編譯，怎麼樣被運行，這些環節上有哪些需要設計、注意的，讓他執行地更有效率、更 reliable"
        ]
      },
      {
        "subtopic": "教授對於上大學後的時間分配有什麼建議？",
        "answers": [
          "如果叫你通通拿去念書，你也不會做啊，因為每個人想法不同。不過我會建議不要把所有時間都花在課程上。花一些時間在人際關係，比如跟同學的交際，或參加社團。畢竟台大是一個大型的綜合型大學，把所有時間都花在系上的課程學習有點可惜。學習跟人合作、相處，也是大學很重要的一個環節。此外，很多資訊技能並不在課程裡面。我鼓勵大一的同學，在大一寒假的時間或一升二的暑假中，自己找一個有興趣的專案來做，經過一年的薰陶，你應該對程式有興趣，有一些你可能想進行的事。",
          "在三十年前，一升二的暑假，我寫了兩個程式，撿紅點和魔術方塊，只是在暑假想找點事情做。我相信你們現在的環境跟資源更好，比如你可以去業界實習，或設定一個目標，也許是學一門線上課程，然後用所學的知識做一個專案。綜合來說，我會建議兩方面：第一個就是開拓你的人際關係，其實我很鼓勵同學參加社團，否則，你念了四年只認識資訊系的學生，不見得是好事；到了不同的年紀，你會需要會計師、律師和醫師的幫忙，如果認識不同領域的人，對你未來會有幫助，也可以理解不同領域的人對同個議題的看法。甚至如果你未來想創業，有不同背景的人比較容易成功。第二個，不要只做系上課程要求的事。如果你對資訊有熱情，應該會想進行一些你自己有興趣的專案。"
        ]
      },
      {
        "subtopic": "請問教授如何判斷自己何時適合開始實習？",
        "answers": [
          "我覺得你有這個想法跟興趣，就去找找看，如果人家願意錄取你，就表示你適合開始實習啊（笑），若面試的結果大家覺得你還太早、不適合，那就代表你還沒準備好。在我們那個年代不太實習，機會也少，現在的學生實習的目的是甚麼？是為了賺錢呢？還是說想要藉由實習去獲得一些實務經驗，可能另外要考慮的就是說實習的工作本身對你有甚麼幫助。有些實習不見得對你的資訊技能有太大的幫助，只獲得金錢上的報酬而已，適不適合，視個人的需求去判斷。"
        ]
      },
      {
        "subtopic": "教授建議學生如何發現自己的興趣、並決定未來研究方向？",
        "answers": [
          "我覺得比較好的有兩個。一個是專題，系上有專題研究，而且不限年級、次數，所以是可以在你覺得 ready 的情況下就去找老師，甚至多個老師，進行專題研究，會讓你對某個領域有較深的了解。",
          "另一個是修課，可以藉由選修課去判斷你對這些課程的了解。通常最簡單的是，先從必修大概理解對哪些方向有興趣，假如你作業系統、網路修得很好，那你可能適合系統類的研究；如果你修演算法修的很有興趣，那可能適合走理論分析。有些應用課程都在選修裡，像人工智慧、圖學視覺、資料檢索等，這些都是屬於比較基礎的選修課，你可以從裡面去判斷對哪一個大方向比較有興趣，而這大方向下還有很多更細部的選修課。你可以在有了大方向之後，就找這大方向的老師做專題試試，或是在這大方向之下，再找更進階的選修課，修過之後覺得真的有興趣再去修專題。",
          "再來我必須強調，研究所的研究方向，畢竟只是一個時期裡面，你有興趣和投入心力的一個方向，不見得你一輩子都要做這個方向。研究生的訓練其實很大一塊是訓練你解決問題的能力，而這並不限於特定問題。其實到博士也一樣，博士所做的論文領域，並不表示你一輩子只能做這個領域，所以其實也沒那麼嚴重。"
        ]
      },
      {
        "subtopic": "請教授發表一下對出國唸書 / 留在國內升研究所的看法？",
        "answers": [
          "就出國來說，現在大部分同學出國的目的都是念碩士，接著在國外找工作，和念博士然後進入研究領域，我覺得是兩個不同的路徑。跟在台灣不同，在美國這個系統是這樣：大學畢業後，如果你想工作就直接去，其實不需要念 CS（Computer Science） 的 master（相當於台灣的碩士），想要研究就直接念 CS 的 Ph.D，也不需要念 master，美國大部分的碩士班反而是用來設計給大學部不是念資訊科學，但未來想走這方向的人。如果你是要出國做研究，那其實大學畢業就可以去申請博士班了。",
          "可是並不是所有人都適合，有些學生他準備好了，包含語文能力、對生活的適應能力、履歷表，畢竟博士生的錄取是很困難的一件事，相較於來自全球各地的其他申請者，大部分大學部的學生畢業時不會有很好的履歷，所以如果大學畢業想去申請美國好的學校的 Ph.D，大部分的大學生是做不到的。但是少部分的學生是做得到的，如果在大學的時候有繼續跟教授做專題，有些論文的發表，累積很好的一些研究經驗。其實我也是在台灣念完碩士之後才出國念書的，碩士有一個優點就是讓你對研究領域有比較深入的了解，有更長的時間讓自己準備好，特別是碩士以研究為主，你一定會累積比較多的研究經驗，可以幫助你申請到好的博士program，如果你想出國念碩士然後工作，那就要看你的經濟能力了，其實我有學生念完碩士出去工作了 3~5 年再到美國念碩士、 program，如果你想出國念碩士然後工作，那就要看你的經濟能力了，其實我有學生念完碩士出去工作了 3~5 年再到美國念碩士、工作，有些人在台灣工作之後發現到國外工作會更符合他想做的事，才決定出國，這個時間點不是早做就比較好，想清楚再去做就是了。"
        ]
      },
      {
        "subtopic": "最後請教授對新生說幾句話。",
        "answers": [
          "歡迎大家來到資訊系！",
          "我覺得大學跟高中有滿大的差異，很多同學會因為這樣有點迷失，特別是住宿舍的同學。要想清楚自己到大學想要獲得的是甚麼，四年後畢業時，你想成為什麼樣的人。四年說長很長，但等到畢業典禮時，你會發現一晃眼就過去了，所以如果沒有在入學時就想清楚，到後面你可能會比較辛苦。",
          "比如說你想出國念博士，也許就要早點立定志向、做些專題，累積經驗；如果你想成為程式高手，那就要比較刻苦的練習；也許你想創業，或許你應該去加強人脈、磨練管理與人際交流的能力。所以想一想自己四年後希望成為什麼樣的人，在這四年好好利用台大或線上能獲得的資源，盡量別浪費過多時間在一些不必要的事上。要試著提醒自己，畢竟剛上大學，不像高中都是安排好的課程，很多時候是你自己要做決定、要做到甚麼程度。如何調適自己？我想自制能力跟有一個目標滿重要的，勉勵大家，也祝福大家的大學生活充實而快樂。"
        ]
      }
    ]
  },
  "hungsh": {
    "title": "洪士灝教授",
    "mailto": "hungsh@csie.ntu.edu.tw",
    "website": "https://www.csie.ntu.edu.tw/~hungsh/",
    "author": "涂宇杰、周奕勳、林語涵、王品翔",
    "image": "/professors/hungsh.jpg",
    "content": [
      {
        "subtopic": "教授認為高中跟大學的學習環境跟方向有什麼樣的差異，該如何調整自己的學習方法因應這些變化？",
        "answers": [
          "高中一般來說是整班一起學習，在班上每個小時上什麼課，都按照課表進行。到大學時慢慢有更多彈性，你可以選擇自己喜歡的課。高中跟大學之間有一個過渡的時期，你大一的時候還是會跟同班的同學一起上系上的必修課，到高年級時會有更多時間可以選擇自己喜歡的選修課。",
          "我會建議大一的同學剛進來，在過渡的時期可以預先去準備大二、大三、大四的生涯規劃。現在學校有領域專長的制度，你不只是來唸資工系，唸完的時候畢業證書上還會註記著你的領域專長。你可以跟人家講，我是資工系，而且我的專長是什麼，例如說我的專長是計算機系統、我的專長是人機介面。這些領域專長的設計是幫助大家提早規劃，如果想要拿到一個人機介面的專長，這個專長有 3~4 個層次的課，大家可以提前規劃將來要修哪些課程來取得想要的專長。"
        ]
      },
      {
        "subtopic": "很多新生進入資訊系時，從未深入接觸過電腦科學領域，產生許多不適應，教授有什麼樣的建議嗎？",
        "answers": [
          "我聽說去年，很多人不適應最大的痛點應該是在計算機程式。計算機程式對某些人來說就像很自然的第二語言，不會有什麼太大的問題；但有些同學完全沒碰過，他們的不適應性可能會非常高。",
          "我覺得最需要改的是：不要只是會讀書，而是要會動手做。我自己高中學程式的時候，完全沒有老師教，拿一本書，程式碼就打進去。現在打開一個網頁，程式碼複製貼上就進來了，或者到一些 Colab 上面，連程式碼都不需要自己編，只要跑就好。可是如果只是看而少了動手做的部分，就會少了一些什麼，在面對更複雜的系統時，會越來越辛苦。哪怕是再基本的作業，自己動手做了之後，就會發現程式運作的原理其實很簡單，可能是一開始想要太快去達到強者經年累月才會的那些目標，所以變得很複雜而不適應。"
        ]
      },
      {
        "subtopic": "教授建議新生該如何安排大學課表，對於大一先修高年級的必修有什麼看法嗎？",
        "answers": [
          "有些課不一定要到了大三再修，其實可以搬到大二就修，如果同學很清楚這門課跟未來想要鑽研的方向是一致的話，那就可以提前修。假如說，我對設計電腦很感興趣，那大二就可以修計算機結構了，因為修計算機結構之前不需要很多演算法、資料結構的知識，而是談電腦底層基本的運作。當然修過作業系統再去修計算機結構會比較好一點，但如果不修作業系統能不能修計算機結構呢？我的答案是可以的，只是裡面會用到一點點作業系統的概念，可以透過自己學的方法去補足。",
          "我自己大一的時候花了很多時間在社團、運動上面，像我參加了橋牌社、象棋社、火箭社，平時沒有課的時候就在社團裡面，不然在台大裡面，沒有社團好像就沒有歸屬感。現在情況好一點，整個地下室都是系上大學部學生活動的場所，但是過去我讀大學的時候沒有一個讓大學部同學聚在一起的好地方。"
        ]
      },
      {
        "subtopic": "教授認為新生該如何規劃自己大一生活，像社團、系隊、打工等許多活動，又該如何與課業做協調，有什麼事是大一該好好把握的嗎？",
        "answers": [
          "我自己大一的時候花了很多時間在社團、運動上面，像我參加了橋牌社、象棋社、火箭社，平時沒有課的時候就在社團裡面，不然在台大裡面，沒有社團好像就沒有歸屬感。現在情況好一點，整個地下室都是系上大學部學生活動的場所，但是過去我讀大學的時候沒有一個讓大學部同學聚在一起的好地方。",
          "我大學四年每天總是有三個小時在球場上，每天傍晚就去打球，這對身體健康其實是一件很重要的事情。如果各位將來要走的遠一點，或是要能夠連續兩天不睡覺趕報告（當然這不見得是好事情），這就是養兵千日用在一時的道理。大學的時候把身體練好一點，將來要是出現一個需要你不眠不休才能去解決的關鍵難題，遇到這種臨危受命的時候，你的身體就是一個很重要的支柱。",
          "我建議大一的時候，加入一些真的有興趣的社團，花一些時間在交朋友跟運動上面，但同時還是要能夠專注在課業。我怕有些同學把全部心思都放在課外，反而課內的部分產生問題，最好課外跟學業可以兼顧。大家能夠進到我們系上，我相信絕大多數的同學都是有能力做到的，但也不要說成績一定要排在班上前面才行。我整個大學的平均成績是中等的，但是我覺得成績可以表現在中等，而且課外可以兼顧到自己想做的事情，這樣就很棒了。可能有同學認為，為了把成績衝到很高，每學期都要拿書卷獎，因此放棄社團或不大運動，這不會是我想做的選擇。"
        ]
      },
      {
        "subtopic": "請問教授學生平時除了修課之外，該如何自學打好基礎呢？",
        "answers": [
          "如果你對一些科目有興趣的話，可以提早去修課。以計算機結構為例，大一的課修完，大二就可以去修計算機結構，修完大三就可以去找教授做專題。為什麼強調做專題這件事？專題研究在國外叫做 Directed Study，在指導老師的引導之下，做專題研究時就不會像無頭蒼蠅。老師也會提供實驗室的設備資源，與其他的同學討論，讓你學得比較有效率。一個人埋頭苦幹在那邊學，相對來說是比較沒有效率的。",
          "另外還有社團，我以前參加科技性的社團，裡面有些人在玩些有的沒有的。譬如DIY做一些電子設備、做音響、討論電腦、組裝電腦等等的。如果對軟體寫作很有興趣，網路上有很多 Open Source （開源）的社群，資訊領域的人很早就透過網路進行很多討論。不過我自己是不浪費時間在非專業社群上做些不深刻的討論的，不如拿這些時間跟網路上的專家來做一些有意義的討論，到專業社群上交一些朋友，學到一些東西。"
        ]
      },
      {
        "subtopic": "請問教授建議學生如何找到自己的興趣方向，並決定自己專題領域呢？",
        "answers": [
          "我想，先不要那麼堅定地要去找一個領域，可以先鎖定兩、三個感興趣的領域，對這些領域多去做一些了解，這樣一來到最後必須做選擇的時候，大學時做的這些功課都可以派上用場。什麼時候會去做選擇呢？例如以後要去讀碩士班的時候，你就要去選擇跟哪位指導老師，每位老師都有他的專長，所以你在選指導老師的時候就等於是在選自己的專長。",
          "如果只想要有一個專長領域，等於把雞蛋都放在同一個籃子裡面。你要確定自己真的很適合在這個領域發展，而且這個領域有未來的發展性。但通常多幾個領域會是比較保險的，比較不會押錯寶。例如我大學就壓在幾個地方，一個是我本來想去唸通訊，如果後來真的唸通訊的話我現在可能就在電機系的電信所教課了。另外我也想做 AI，因此我大學的時候修了好幾門 AI 的課，此外我自己也陸陸續續看了一些跟電腦系統實作相關的東西，基本上我有這三個技能。",
          "出國唸研究所的時候，我就去看這間學校、這些老師在哪個領域做得怎麼樣，也有實際去修課。發現那時候 AI 市場很差，因為有一陣子 AI 什麼都做不出來，結果美國政府把研究經費全部收了，覺得這些做 AI 的都是騙子。我看到這個狀況，就不做 AI 了，剛好我去的密西根大學有超級電腦可以玩，我就改去做高效能計算。",
          "所以說多幾個技能，比較有保障，因為不是什麼事情都能夠照你的意思去安排。那至於怎麼選領域呢？我們系上大致可以分成七個領域：計算機理論、計算機軟體、計算機系統、計算機網路、智慧系統、多媒體系統、生醫資訊，這是大方向。有人可能會覺得這些大方向太籠統，所以現在推出領域專長，大家可以去參考一下領域專長上面的描述，是不是你想像的那個樣子。"
        ]
      },
      {
        "subtopic": "資訊系學生去公司實習的風氣逐漸興盛，教授有什麼看法嗎？教授會建議學生大一、大二的時候就開始找實習嗎？",
        "answers": [
          "我覺得大一、大二太早了。一般來說大一、大二會的只是資訊系的基本技能，雖然已經能幫外面的公司做一些事情，但同學們學到的也相對有限，可能就像是打工賺賺錢而已，如果本人還以為業界就是這樣子的話，那可能就被誤導了。",
          "這些基本技能就可以做的工作不是說不重要，往往也很需要人，例如業界一直很缺軟體工程師，但工作性質可能跟將來各位大學畢業，或是念完研究所之後所能從事的工作差很多。所以大一、大二實習的經驗，有效的參考價值是多少呢？我會打上一個問號。或許等你對某個專業有比較深的了解，再朝那些專業方向看過去，找出有哪些公司在這方面做得滿不錯的，會想知道究竟他們如何做出這些創新？如何帶領世界往前走？這時候去加入這樣的團隊，去實際體驗，會比較清楚人家運作的方式。",
          "所以我覺得不必急，不過現在我看到有不少人過度強調實習很重要，或是聽網路和 PTT上學長或路人講說老師們教的都太過理論，實習才能了解真實世界。這些話也不能說是錯的，可是他們眼中的真實世界可能是偏的。真正在業界做得有聲有色的人，大都沒有那個美國時間泡在網路媒體上說一些酸言酸語。所以你要實際去看到全貌比較重要，不要只是看到一些片面，很多人講的，或者只是講身邊看到的狀況，不一定是完整的真實狀況。事實上當你能力比較強、知識比較廣、眼界比較高的時候，你會看到的東西，往往和你初期接觸到的截然不同。",
          "目前系上學生的風氣有點偏向實習導向，但是在廣度和深度不足的狀態下看到的可能就只是冰山一角，對大一、大二而言，他們並不一定知道冰山到底有多大，在這種情況下要怎麼讓他們知道冰山不只是水面上這麼一塊呢？其實不用急，實習當然也很好，但絕對不能當作對工作完全的認知。",
          "業界上一些名列前茅的大公司在做些什麼，其實網路上可以看到很多的資料，這些大公司甚至很鼓勵員工沒事就發部落格來討論一些東西。但這裡來了一個障礙――語言：你如果在本土，只看本土社群的討論，只去過本土公司實習，資訊可能不足。本土公司有時候神神祕祕的，做了東西不太願意寫出來，當成是商業機密。其實你去看 Google 這些大公司，經常刊登一些技術文章來宣傳他有多厲害，很多技術都不怕你知道。",
          "因此我覺得一個很好的方式是從網路上去看這些業界究竟在做什麼，其實很多業者把在研發的技術、做的產品資訊，都放在網路上。你如果看多了，甚至是透過一些社群去跟人家討論，就會知道國外的業界是這樣在做的。那再回過頭來，你可能會覺得比較失望的是，國內在純軟體的研發和市場，還是跟國外是有一段距離。但也不用太失望，因為國內業界也有他厲害的一面。那這時候你究竟是要怎麼看待自己的未來發展，有人想，「啊國內就是這樣子，我做得再厲害也沒有用」。還是說，你可以去學到比人家厲害的地方，在業界當領頭羊。我覺得在台大資工系，大家可以試著朝怎麼當領頭羊發展。"
        ]
      },
      {
        "subtopic": "教授對於出國交換或留學有什麼看法，若有意願的話應該要做什麼準備？",
        "answers": [
          "我覺得各位同學可以先留意一下學校或是相關來源有沒有比較合適的計劃，像是我們系上有一些可以去國外交換的計劃案，各位同學可以留意一下相關的資源。也可以先接觸一下相關老師，例如某個老師跟這個計劃案比較有關，那麼當同學要出國交換的時候，這個老師可能就可以幫你寫推薦信。另外出國留學可能有一些選擇，大學的時候就交換、大學畢業的時候留學，或是研究所出國，這些都可以考慮看看。",
          "出國留學、交換很多時候都需要老師的推薦信，每個老師寫推薦信的標準多多少少會有點不一樣，但是如果你可以讓老師有印象，就可能比較有機會。例如修老師的課成績比較高，上課的時候常常發言，或是去當老師的助教，參與老師的實驗室，這些都是加深老師對你的印象的方法。"
        ]
      }
    ]
  },
  "cwlin": {
    "title": "林忠緯教授",
    "mailto": "cwlin@csie.ntu.edu.tw",
    "website": "https://www.csie.ntu.edu.tw/~cwlin/",
    "author": "林天行、王政祺、毛翊蓁",
    "image": "/professors/cwlin.jpg",
    "content": [
      {
        "subtopic": "教授認為資訊系的學生要如何才能發展出不同於其他領域的專業？",
        "answers": [
          "大家心目中的程式可能是 input 吃進來得到正確的 output ，但是什麼方法是最有效率的，或者什麼方法會有什麼特性，我覺得這是資工系學生需要理解的。我相信我們系的程式設計課程是全校最難的，後續的資料結構、演算法等課程也會讓大家更加深入理解程式背後的思路。另外系統程式、作業系統（大二上必修跟大二下必修）讓大家理解程式在系統上到底怎麼運作，這也是我們系很專業的課程。"
        ]
      },
      {
        "subtopic": "教授認為資訊系的學生除了資訊能力外，還需要具備哪些軟實力？",
        "answers": [
          "我覺得是看大家興趣在哪裡。相信大家也都知道，未來趨勢對我們系的學生當然是大好，路很寬廣，各個領域都很有發展機會。軟實力的話當然可以講說團隊合作、跟別人合作、跟別人溝通、作為一個好人但又不是濫好人，我覺得都很重要，畢竟將來大家都要出社會。"
        ]
      },
      {
        "subtopic": "那想請問教授建議學生可以如何在大學生活中找到自己有興趣的領域以及培養專業能力？",
        "answers": [
          "我覺得還是以學習為主，學習也就是從修課先開始，然後高年級以後專題可以多試幾個沒關係。我知道現在也有很多同學暑假去做實習，我覺得也很好，就是去看工作會長什麼樣。有些同學可能也有自己的興趣，像是社團等等，有人對運動很有興趣，那說不定以後就可以將資訊工程的技術應用在運動，或是有人對車子很有興趣，那就可以應用在車子上。"
        ]
      },
      {
        "subtopic": "高中跟大學的學習環境有什麼差異？可以如何調整自己？",
        "answers": [
          "大學就是很自由，不管是學習還是其他事情，很多事情可以有不同的價值，大家各自做各自的選擇。有些同學想修很多課，這樣很好；有些同學只想修最低學分，這樣也很好，反正就是自己想清楚、自己做決定。學習的話，我覺得大學是沒有範圍的，雖然老實講大家將來多多少少還是會重視成績，因為要申請學校或者推甄等等還是會看成績，但是考試或作業或報告可能不像高中怎麼樣就一分、怎麼樣就兩分，或者考試可能很難，方向跟想像的完全不一樣。我覺得大家就還是著重在自己的學習，分數當然要爭取，但也不要過度在意。"
        ]
      },
      {
        "subtopic": "新生該如何規劃自己的大一生活？",
        "answers": [
          "請好好享受大學生活。大部分同學會遇到一些挫折跟失敗，但是好多年以後回來看，這四年應該還是人生中最快樂的幾年，就好好享受吧！自己選擇，然後對自己負責。",
          "不免還是要說學習是蠻重的一塊，但是如果把大學生活都只放在學習的話也是有點可惜，就是自己要學會時間規劃，不要做超多事然後什麼事都做不好，要有所取捨。"
        ]
      },
      {
        "subtopic": "很多新生進入資訊系時，從未深入接觸過電腦科學領域，因而產生許多不適應，教授有什麼樣的建議嗎？",
        "answers": [
          "就跟打籃球一樣，每天看 NBA 你還是不會打籃球，就像學寫程式只看不練，就學不會。我自己寫程式的經驗就是要多花時間練習，然後程式到最後是實作你心裡的邏輯，在嘗試、練習的過程中也可以訓練自己的邏輯。"
        ]
      },
      {
        "subtopic": "想請問教授建議學生可以如何在大學生活裡面找到研究方向？",
        "answers": [
          "我覺得大一大二有點早，畢竟很多基礎課程沒修過。我覺得大部分同學大三再開始考慮研究就可以了，除非真的很早就立定志向往某領域發展或決定要唸博士。系上教授開的選修大部分都是跟自己研究有關的主題，大家可能一開始不知道要跟哪個老師，那就去修他的課看看。舉例來說，我有一門課是智慧型汽車導論，就跟我的研究比較有關，我也會建議很多想要加入我的實驗室的同學先去修。另外就是大學部的前瞻資訊科技課程，每個老師上兩週也是一個很初步的理解各老師的主題。"
        ]
      },
      {
        "subtopic": "想請問教授是從什麼時候要往研究的路上走的？又是什麼時候決定要回台大任教？",
        "answers": [
          "我大學的時候是覺得將來可能要讀博士，但是碩士班的時候才決定要出國讀博士。我自己覺得大學專題通常還是比較粗淺的體驗，因為同時還要兼顧其他事情，涉入就不會太深。通常碩士班的時候才會對研究有更深入的了解。會回台灣因為家人都在台灣，所以想要回來。剛才講到唸博士這件事情，要提醒一下，其實大學畢業就可以申請進入博士班。國外博士班，普遍是教授幫你出學費跟給你生活費，所以不太需要擔心財力，但是既然教授要養學生，一定也是非常競爭。"
        ]
      },
      {
        "subtopic": "因為教授大學讀資工系，然後研究所轉往電機領域的方向，想請問教授後來回來為什麼是在資工系任教而不是繼續在電機的領域？",
        "answers": [
          "我碩士班唸的是 EDA（電子設計自動化），我去唸博士班的時候博士班的老闆也是做 EDA 的超級大咖，但是當時他正在往大系統發展，他就給了車內通訊、如何保護資訊安全的題目給我，做得就比較偏向資工了。我覺得電機跟資工其實沒有差那麼遠，雖然課程會讓大家專長有所不同，但是將來要再跨我覺得也不是問題。"
        ]
      },
      {
        "subtopic": "教授對於畢業之後直接去工作的看法？",
        "answers": [
          "這個問題有兩個面向。第一面向，如果沒有要做研究到底要不要念研究所，我自己是覺得不用，大學畢業就可以去職場了。第二面向，學歷還是有點通貨膨脹，很多公司直接說要具備碩士學位，這個雖然我自己不是這麼認同，但是如果你真的想要去那些公司然後他們又有要求要有碩士學位，那就是用碩士班兩年好好充實自己。站在整個社會或是國家發展的立場，我們當然希望台灣的博士要再多一些，像我們系上多少還是面臨師生比偏低的問題，就是老師相對偏少。",
          "國家發展相對會需要很多資訊領域的人才，但如果老師不夠的話，訓練學生當然也是一個問題。當然很多人唸博士會出國唸，然後留在國外，但是也自然會有人回台灣。但是回到一開始，雖然整體來說希望更多人讀博士，但我覺得這還是自己的事情，我還是相信每個人自己做自己的選擇，每個人自己的選擇決定未來要怎麼做。"
        ]
      },
      {
        "subtopic": "最後請教授對新生說幾句話。",
        "answers": [
          "恭喜大家進入我們系上！這應該是一個環境很好，而且未來發展非常有潛力的地方。大學是一個很自由的地方，所以應該可以過得很快樂。未來幾年大家應該以學習為主，但還是有很多多采多姿的生活可以體驗。例如社團、系隊、談戀愛等，想要過什麼生活都好，要自己去選擇，然後不管是成果、後果都是要自己負責。過程中一定有很好或很不好的事情發生，但這都是一個過程，大家就是盡可能去享受。"
        ]
      }
    ]
  },
  "pangfeng": {
    "title": "劉邦鋒教授",
    "mailto": "pangfeng@csie.ntu.edu.tw",
    "website": "https://sites.google.com/view/pangfengliu/home",
    "author": "曾顯恩、林方綺、王品翔",
    "image": "/professors/pangfeng.jpg",
    "content": [
      {
        "subtopic": "身為許多大一生應該都蠻怕的計算機程式設計的教授，請問能給尚未入學的學生一點建議，讓他們能提早習慣、準備即將面臨的考驗嗎？",
        "answers": [
          "我提醒你們，這門課滿重要的，沒學好的話系統程式都不知道要學什麼。關於這門課，這裡寫得很清楚了"
        ],
        "links": [
          {
            "name": "劉邦鋒教授給大一新生的信",
            "href": "https://docs.google.com/document/d/1zg3HWT8DvJ06T-P80Bwip2_zpn_P-M92u5uaMrawtAo/edit?fbclid=IwAR03GXTxWM3i7tt8Tbe6lxW_Wu7ZBDKlIxB5QQKs766V9EmzHB-GBD31QB8"
          }
        ]
      },
      {
        "subtopic": "教授會建議在大一大二的時候盡快決定研究方向嗎？",
        "answers": [
          "要看怎麼定義課業以外，英文算不算是課業以外？英文是很重要的東西，聽說讀寫都要很熟悉，才容易吸收跟報告現在大家在做甚麼，聽懂大家在做甚麼，把想法跟更多人溝通。還有一個是課業內絕對不會有的，就是學習新技術的能力，computer science 這種東西基本上沒有甚麼是可以永遠維持的，現在討論很酷炫的東西大概幾年後就會淘汰，工作中免不了會碰到這些事情，你要很快的學會新技術，而這能力事實上是這四年培養出來的，也就是說，這四年決定你的核心能力，因為計算機前端後端、計算機系統、編譯器，這些基礎在我們的課已經 cover 了，所以在外面碰到的其他轉換、變形、一些潮流，如果你在資工系這四年有好好學，我認為是足夠應付。"
        ]
      },
      {
        "subtopic": "針對畢業之後是要出國唸書或是繼續在國內升研究所，教授有什麼看法？認為需要做什麼準備？",
        "answers": [
          "大家都知道我是出國派的，鼓勵大家去國外看看國外的研究所是怎麼做研究的，我個人不能比較，因為我沒在台灣唸過研究所，但你唸過研究所再出國也可以啦。我們台大不是百大嗎，我是蠻鼓勵大家出國的，去了解世界前二十大的大學裏頭的研究所課程要求，你就會覺得跟台灣不太一樣。那如果你在台灣就業的話，台灣的就業習慣大概就是去刷題、去學新技術，大概準備就是這樣，但其實不管哪一個我都覺得英文能力是相當重要的，無論出不出國都很重要。"
        ]
      },
      {
        "subtopic": "教授對於接 case、家教有什麼看法？",
        "answers": [
          "現在先把基本能力先培養好，先好好念書，除非你有生活問題，比如說你不接家教就沒飯吃、活不下去，那些都是小錢，你真的學不到甚麼。若是人際溝通，將來你去修一門課接一個 team project 就知道人際溝通是甚麼樣的，比如說要慎選隊友、怎麼分工、API 怎麼切，這些重要多了吧！我常跟我學生講，你們最寶貴的就是時間，你們跟我這個老頭子的差別就是我沒有時間，但我有你沒有的東西，我有能力、經驗，我有學歷、經歷，我唯一沒有的就是時間，那你拿甚麼跟我比，你有時間啊！我們做事大概最多就是 10 年，你可能可以再做 50 年，為什麼要拿你最寶貴的東西去換你現在不缺的東西呢？如果可以用錢換時間我絕對做，我要拿時間來做我想要做的事情。"
        ]
      }
    ]
  },
  "pjcheng": {
    "title": "鄭卜壬教授",
    "mailto": "pjcheng@csie.ntu.edu.tw",
    "website": "http://www.csie.ntu.edu.tw/~pjcheng/",
    "author": "黃俊翔、林天行、王政祺",
    "image": "/professors/pjcheng.jpg",
    "content": [
      {
        "subtopic": "有很多新生在剛升上大學之後會因為身邊有很多強者而感到受挫，教授會建議新生們在心態或學習方式上有甚麼調整？",
        "answers": [
          "由於大家高中接觸 CS 的經歷都不一樣，有人可能比較早進入這個領域，尤其像是計算機程式設計這門課的題目，有人可能五分鐘就寫完了，有人則要花上一整個下午。但這其實可以想說，那些人只是比較早起步而已，何況其實不止 CS ，每個學科都有人比較早開始學，所以我覺得用一個健康的心態來面對會比較好。雖然真的在執行的時候，受挫感一定會比較深，但就如同我剛剛所說的，可以用健康的心態去找其他同學交流、把這個差距慢慢地縮小。事實上那些真的很天才、可以無師自通的同學真的是少之又少，大部分的同學都是一步一步這樣走來的，擔心是難免的，但也不用因此壓力太大。"
        ]
      },
      {
        "subtopic": "教授認為新生在打工、休閒、愛情、社團等等課外活動該如何選擇，那些事情一定要把握？",
        "answers": [
          "個人很鼓勵大家多接觸，因為來這裡不是為了求學，某種程度也是來生活的，其實這中間的任何經歷我都是樂觀其成的，不一定說只是為了錢，這些經歷對踏入社會的另外一個階段是一個很好的養分。",
          "選擇的部分我覺得就見仁見智，沒什麼對錯之分，不過我比較擔心的是愛情的部分，系上很多學生會因為在學業上很順遂、就誤以為在其他的領域也會如此，再加上以前在這方面可能沒什麼經驗，就會不太清楚被拒絕時該怎麼調適心態，而我過去看過很多學生都是在這方面受到挫折。",
          "學業了不起就是延畢，比較是屬於短期的問題，除非自己不念書，只要願意付出的話一定是有辦法解決的，但感情方面是強求不來的，這一塊是我們過去看到比較會有極端的情形產生，也是我們比較擔心的。",
          "那對於這些壓力與挫折，我很鼓勵大家去約系上專業的心理諮商師，他已經輔導了大量的學生，常常行程都是滿的。又或是大家也可以去找導師談談，我覺得大家可以把導師當成朋友，而不只是一位吃飯的對象。大家遇到問題真的不用不好意思，如果大家發現自己的心態跟過去有很大的差異、或是覺得不太認識自己，那其實代表你在經歷很大的轉變，如果這樣的轉變比較負面、或是自己不太喜歡的話，那就建議你去尋求比較專業的協助了。"
        ]
      },
      {
        "subtopic": "建議學生需要先做些什麼準備才能應付比較困難的課程？",
        "answers": [
          "我覺得直接去問那位老師就可以了，如果感到困惑大膽的去敲門，我相信老師們都很樂意分享。那除此之外呢，你們還可以多接觸那個方向其他的書籍，不一定要是教科書，舉例來說，有些同學在看程式設計的課本時比較不能接受語法生硬的內容，但有些書籍是從應用著手、比較容易能讓同學進入狀況。那只要稍微有點概念後，就比較能夠吃下老師講課、以及教科書中的內容了。"
        ]
      },
      {
        "subtopic": "教授會如何建議未來想做專題研究的學生找到研究方向？",
        "answers": [
          "其實我很鼓勵大家去接觸專題，做專題是一個從找到問題到解決問題的一個訓練，及早接觸、多方面看看，找導師、授課老師、系主任都是很好的管道。",
          "我覺得大三再銜接專題是非常 ok 的，但我更鼓勵同學們在大一、大二時就開始接觸，我建議你們可以一間一間實驗室去看，即使你對於那個實驗室的目標、技術都不清不楚，但你只要願意去聽，就會耳濡目染，多去參與、多去聽他們的報告與發表，就更容易找到自己的興趣以及需要的能力。",
          "那也不用擔心說做出一些嘗試會跌倒，現在跌倒就只要站起來就好，但未來跌倒會受傷，不要因為長大了，就收起小時候勇於跌跌撞撞的精神。總之就是去多方嘗試，不要害怕失敗、也不用把自己綁死在一個地方。"
        ]
      },
      {
        "subtopic": "對新生講的話。",
        "answers": [
          "升上大學後，心態一定要有所調整，大學就像是一個小型社會，任何問題都沒有標準的答案，比起答案會更注重討論。大學之前的制度就只是難度持續的增加，但大學生活就不只這些東西了，不是把事情做好就會得到高分、受到肯定，如果期待的是這種舊式的思維，那會是非常可惜的。話雖如此，大一的同學們也不用太緊張，慢慢地接受這樣的改變就可以了。",
          "那除此之外，在訪談中有一再地強調，希望學生不要覺得跟老師有所隔閡，不要害怕去和老師們約時間，你不跟老師們互動，老師就算有心也不知道該如何幫助你，這邊的環境就是你願意付出、追求的越多，能收穫的就會更多，畢竟老師再怎麼樣的主動想要幫助，終究還是比不上學生主動的尋求協助來得有效率。"
        ]
      }
    ]
  }
}