{
  "title": "陳祝嵩教授",
  "mailto": "chusong@csie.ntu.edu.tw",
  "website": "https://imp.iis.sinica.edu.tw/",
  "author": "曹紹洵、陳泰穎、廖禹喬、王褕立",
  "image": "/professors/chusong.png",
  "content": [
    {
      "subtopic": "教授認為高中跟大學的學習環境跟方向有什麼樣的差異，該如何調整自己的學習方法因應這些變化？",
      "answers": [
        "高中因為升學的競爭，學生可能會比較單純的為考試而學習，所以會非常注重要在各種考題上都能拿高分。大學當然也會有很多考試，但也會有別的學習的活動，比如程式的撰寫、或是各種系統、網路等等有關的操作，以及文獻閱讀和專題報告等；也不是說考試分數這些不重要，但這不見得是單一的，重點是你學到了什麼。而且現在的分數是等第制，其實有個比較大的範圍。而以教科書來說，高中的時候可能會通通上完，然後每個單元都去練習；但大學的時候就要看老師了，不一定會全部上完，可能會教到比較基本的三分之二，如果你有興趣可以自己再去鑽研後面的。",
        "每個科目的學習上，我覺得可以先求穩，然後再求好；把握自己本系的基本科目，有時候課業也都會有點重（笑），但至少可以穩固過關再慢慢讓自己去進步。有時候你在某些方面比較有天份，或是本來就有鑽研過，自然而然就會比較佔優勢；但如果你完全沒有接觸過，那可以多多參考前人的經驗。"
      ]
    },
    {
      "subtopic": "很多新生進入資訊系時，從未深入接觸過電腦科學領域，產生許多不適應，教授有什麼樣的建議嗎？",
      "answers": [
        "完全沒接觸過的話，比較建議大家要先求穩定，不要一下子就給自己太大壓力，覺得「我要做的跟強者一樣」。一開始是很不容易的，但你至少要讓自己都能至少過關。也因為有強者在，有時候同儕間互相地、不經意地聊個一兩句，觀念的提升就完全不一樣了。很多時候可以多去跟同學互相接觸，有的強者也是很樂於回答、解決問題的；或者你自己就是強者，這樣應該會碰到很多人想請你給他一些指點，而你也會發現自己能在教別人的過程中有所收穫。其實畢業後十年再看這些事情，就會有完全不一樣的看法；大家頭上各自都一片天，實在是很難分。",
        "再來是這樣高強度的競爭環境，一群人一起為寫程式、寫作業來奮鬥，這不是每個科系都有。這樣的同儕的學習的環境其實是很寶貴的，可能你們現在還不容易體會；在這種環境裡成長出來的人，我覺得不論一開始是一般人或是強者，以後都是很強的（笑）。",
        "不論你現在進來是什麼樣的狀態，至少先求穩定自己，然後再按步就班地進步。"
      ]
    },
    {
      "subtopic": "教授建議新生該如何安排大學課表，對於大一先修高年級的必修有什麼看法嗎？",
      "answers": [
        "我覺得大一大二的課，特別是有程式的課可能會重一些，要好好了解自己有沒有餘裕去修其他的課，因為至少自己本年級的課要先握住。如果想要先修一些高年級的課，一般的話會建議去修數學的課程；雖然都要花時間，但也許用腦的部位比較不一樣，比較能夠互相調劑一下。如果你只是想要讓自己趕快進步所以修了很多程式的課的話，到時候作業不容易趕出來其實也不好。但以上是針對原本沒有程式相關背景者，若自己本身已經在大一大二的課已經行有餘力，就可以比較自由的調配。"
      ]
    },
    {
      "subtopic": "教授認為新生該如何規劃自己大一生活，像社團、系隊、打工、愛情等許多活動，又該如何與課業做協調，有什麼事是大一要好好把握的嗎？對於上大學後的時間分配有什麼建議？",
      "answers": [
        "這個問題是蠻難回答的，很難有什麼標準答案。我只能講我自己經驗，因為不管你選哪一邊，另一邊就會有點遺憾。我以前大學時花比較多時間參加社團，而系上辦的一些活動、營隊什麼的我都沒有參加；他們那時候還去綜藝節目，我也沒有去，因為我主要都在社團。後來我就會覺得，如果再來一次有可能系上活動也多參加一點，但這樣社團活動就會少一點啊。反過來說，那你就試著讓自己不要後悔自己做的選擇，雖然可能會有些遺憾，但你在所選的事物裡會獲得一些屬於自己的東西。",
        "打工的話我覺得適當就好，如果經濟上有壓力的話可能沒辦法，但因為課業也滿重的，如果可以讓自己多一些不論是生活經驗、教學經驗、或是你未來想從事的工作的專業的經驗，我覺得都值得去嘗試。但是你這邊多花一些時間，其他方面就要犧牲一些。",
        "大一新生我覺得可以多方面都接觸一下，雖然你可能沒有特定的選擇，但是接觸之後，可能會發現在這麼多條路之中，你比較想以什麼做為主軸。過了很多年之後，我其實覺得選什麼都有他的好處，有利有弊，要看個人價值觀來做取捨。",
        "至於愛情他發生了就發生了，我以前同學也有很久都沒有女朋友、到碩士班了還在找我抱怨，可是現在小孩都已經……（笑），就是有人比較早有人比較晚嘛。畢業以後十年以後大家其實都差不多，要成家的都成家了，就只是時間的早晚而已。"
      ]
    },
    {
      "subtopic": "請問該如何在大學生涯中，尋找自己有興趣的領域呢？",
      "answers": [
        "系學會有一個介紹專題的網頁，有訪問很多系上的老師，你們可以先上去看看（編注：就是這個網站 XD）。再來系上有門課叫前瞻資訊科技，有點像系上的通識課，會有很多老師、每位老師講兩個禮拜，可以在裡面聽到很多不同的領域，也可藉此來發掘。現在資訊豐富，像 AI 的東西就天天在報導，如果看到有興趣的領域當然就可以直接去找看看系上的老師。",
        "大家也可以跟直屬學長姐、家族或是導師詢問，因為導師都有自己的研究領域；但是也可以問導師問說，針對你比較有興趣的領域有沒有什麼推薦、有那些老師可以去接觸。另外，大一有四位特別安排的大一導師，也可以跟他們詢問。"
      ]
    },
    {
      "subtopic": "資訊系學生去公司實習的風氣逐漸興盛，教授有什麼看法嗎？教授會建議學生大一、大二的時候就開始找實習嗎？",
      "answers": [
        "我不太建議大一大二就去實習，因為大一大二的必修課比較重，比較建議好好修課，先求穩再求好。大三大四就看大家自己的興趣，很多公司很歡迎本系的學生去實習，希望學生畢業之後就去他們公司，對學生來說也算是一種打工。",
        "我覺得你如果想去實習的話，要站在兩方面來看。一方面是你自己學習一些東西；另一方面是僱用你的這一方的方案。通常比較大的公司，就真的是讓學生來實習，其實也沒有期望學生真的要做出什麼貢獻，只是給你一個學習的機會；也有的公司會希望學生能真的做出一些成果。第二種你要負擔的壓力可能會比較大，這時候就要想想看你到底是單純想要去學習，還是你願意擔負更大的責任，培養一些實戰經驗。",
        "這個部分可以多問一下過來人的經驗。有些公家機關或是學術研究單位也有一些實習的機會，像是中央研究院的就會以研究生為主；而像資策會這些財團法人也會有一些實習的機會，有滿多的選擇可以考慮的。"
      ]
    },
    {
      "subtopic": "教授對於出國交換或留學有什麼看法，若有意願的話應該要做什麼準備？",
      "answers": [
        "我覺得各位同學可以先留意一下學校或是相關來源有沒有比較合適的計劃，像是我們系上有一些可以去國外交換的計劃案，各位同學可以留意一下相關的資源。也可以先接觸一下相關老師，例如某個老師跟這個計劃案比較有關，那麼當同學要出國交換的時候，這個老師可能就可以幫你寫推薦信。另外出國留學可能有一些選擇，大學的時候就交換、大學畢業的時候留學，或是研究所出國，這些都可以考慮看看。",
        "出國留學、交換很多時候都需要老師的推薦信，每個老師寫推薦信的標準多多少少會有點不一樣，但是如果你可以讓老師有印象，就可能比較有機會。例如修老師的課成績比較高，上課的時候常常發言，或是去當老師的助教，參與老師的實驗室，這些都是加深老師對你的印象的方法。",
        "另外，有一些系上的教授也有出國留學的經驗，例如目前四位大一導師都是有這樣的經驗的。如果同學真的下定決心的話，就可以考慮提早認真的跟這些教授諮詢一下。"
      ]
    },
    {
      "subtopic": "教授對於出國交換或留學有什麼看法，若有意願的話應該要做什麼準備？",
      "answers": [
        "我覺得各位同學可以先留意一下學校或是相關來源有沒有比較合適的計劃，像是我們系上有一些可以去國外交換的計劃案，各位同學可以留意一下相關的資源。也可以先接觸一下相關老師，例如某個老師跟這個計劃案比較有關，那麼當同學要出國交換的時候，這個老師可能就可以幫你寫推薦信。另外出國留學可能有一些選擇，大學的時候就交換、大學畢業的時候留學，或是研究所出國，這些都可以考慮看看。",
        "出國留學、交換很多時候都需要老師的推薦信，每個老師寫推薦信的標準多多少少會有點不一樣，但是如果你可以讓老師有印象，就可能比較有機會。例如修老師的課成績比較高，上課的時候常常發言，或是去當老師的助教，參與老師的實驗室，這些都是加深老師對你的印象的方法。",
        "另外，有一些系上的教授也有出國留學的經驗，例如目前四位大一導師都是有這樣的經驗的。如果同學真的下定決心的話，就可以考慮提早認真的跟這些教授諮詢一下。"
      ]
    },
    {
      "subtopic": "您覺得資訊系的學生除了資訊能力以外還需要具備什麼軟實力？",
      "answers": [
        "表達能力很重要：當你懂了某個東西以後，要怎麼樣清楚的把他說出來？在高中也許不是那麼強調「說」，但是在大學階段我覺得應該要好好培養這樣的能力。有的時候你甚至可以從講給自己聽開始，當你學東西到一個進度、覺得自己了解了一些東西後呢，你可以想想看要怎麼講給人家聽比較容易懂。有時候這種方式也會影響自己的思維，知道在腦中怎麼整理知識，讓自己也比較容易吸收。這種理解有時是沒有辦法在初級就發生，但你可以不斷的去思考怎麼表達才會最清楚。",
        "在一個團隊裡面會有人扮演強者的角色，也會有人提供另外一種實力，比如說是領導能力，或是寫報告的能力。如果是創業的話，也會需要有人負責溝通、取得投資，進行業務的推展。要培養這一方面的能力，也可以考慮修其他系的課、或是輔系，行有餘力的話可以培養自己第二個專長。"
      ]
    },
    {
      "subtopic": "想請問教授在這幾年的教學經歷中，有沒有注意到我們這個世代有什麼特別有趣的現象，或是對我們這個世代有什麼建議之類的？",
      "answers": [
        "不一樣的地方我可能要想一想，因為我比較沒有觀察這部分。我可以反過來回答另外一個部份：我覺得無論哪個世代，都好像都不太會問問題。我教的比較多是研究所的課程，有遇到過學生很會觀察、詢問，透過回答他提出的問題，老師也比較能夠了解大家聽到這裡，會有什麼樣的疑惑或是產生怎樣的回饋。可惜大部份的時候，都沒有什麼人想要提問。"
      ]
    },
    {
      "subtopic": "現在有許多系都有程式設計這門課，想請問教授資訊系的學生在這方面有哪些差異和優勢呢？",
      "answers": [
        "我覺得我們程式設計的課，跟其他系最大的差異是強度。其他系開的課也叫程式設計，但是我們資工系對學生的教學強度和整個作業的難度，還有真強者這些文化，這些情況都是不太一樣的。別的科系的程式設計課和資工系相比還是有一點距離，假如別系的學生申請轉系或輔系，當他們修了我們的程式設計，就會知道強度是有差的。"
      ]
    },
    {
      "subtopic": "請問教授學生平時除了修課之外，該如何自學打好基礎呢？ ",
      "answers": [
        "看你是想要哪一方面的自學。如果是課業專業有關的，我會建議行有餘力的人去申請雙輔修，因為也不乏有人藉此建立第二專長。興趣的部份，可以參加個社團去學，例如說你對合唱有興趣，那就去參加合唱團；可以的話，我覺得還是跟大家一起學比較容易。",
        "很多時候有些事學校沒有教，就要自己靠搜尋去自學。以 AI 為例，現在到處都有人樂於教學，甚至有些高中生就在自學 AI；鑽研的比較深之後也可以去看頂尖的論文，那些論文你怎麼追也追不完。現在這種網路搜尋的時代，任何領域都有兩個高峰；很會搜尋又很專注的會在前面的高峰，和其他人會拉開差距。"
      ]
    }
  ]
}
