{
  "title": "蔡欣穆教授",
  "mailto": "hsinmu@csie.ntu.edu.tw",
  "website": "http://www.csie.ntu.edu.tw/~hsinmu/",
  "author": "黃俊翔、毛翊蓁、林天行",
  "image": "/professors/hsinmu.jpg",
  "content": [
    {
      "subtopic": "許多新生剛進來時沒有程式相關背景，進來後才發現身邊有許多所謂的「強者」，想請問教授對於學生在心態和學習方式上可以怎麼去調適？",
      "answers": [
        "其實根據我的觀察，剛入學的同學有很大一部份是不會寫程式的，但經過系上許多課程的洗禮，只要大家都有足夠的努力的話，能力和入學時就有豐富的程式基礎的同學並沒有太大的差別，在其他專業技能的發展上也差不多是如此。",
        "心態方面的話，也不用覺得一些人就是神、一些人就是小弱弱這個樣子。以我自己的經歷來說，數學是我比較弱的一環，那系上有很多很吃重數學的課程，當時在修這些課的時候就很需要身邊的大神們給我一些提示，總覺得自己就是要依賴這些大神才有辦法過關。",
        "但後來到國外念書，人生地不熟，也沒什麼人可以一起討論作業，一切都要靠自己，談白講過的真的很痛苦，但後來也因此發現我自己其實也可以處理那些我自己覺得不擅長的數學課程，也可以取得還不差的成績。",
        "所以我想鼓勵新生，相信自己是可以獨當一面的，有時候可以把大神當成一種虛幻的存在，雖然他們可以給你一條捷徑、帶你解決大部分的問題，但要學習的人終究是你自己，非必要的時候不要太依靠神明的力量，我們還是要靠自己，才能有所成長。"
      ]
    },
    {
      "subtopic": "教授對於學生上大學後課內、外的時間分配有什麼建議，像是要如何在各種活動中找到平衡呢？",
      "answers": [
        "我在DSA課程中有一個軟體工程相關的影片叫做 evidence based scheduling，我這裡稍微提一下這個概念。這個概念其實很簡單，就是要對自己完成事情的時間有所掌握。大學階段往往是大家第一次得到掌握自己大部分時間的權利，我們需要務實地去想，有哪些事情要做、這些事情又需要花費多少時間、優先度又是如何，如此一來我們才有辦法做一個有意識的選擇，這是大家過去比較不習慣的事情。",
        "所以我覺得最重要的就是要妥善的規劃自己要完成的事情、並做出取捨，看是要每周做或是以學期為單位都可以，建議大家都可以開始練習做選擇以及估計自己的時間。"
      ]
    },
    {
      "subtopic": "想請問教授，您覺得資訊系的學生除了資訊能力以外，還需要具備哪些軟實力？",
      "answers": [
        "第一點，就是要好好說話，這裡的好好說話指的是把自己想表達的事情，完整且有邏輯的好好表達。我在教學生的這些年，我最大的困擾就是同學們常常在發表一些成果時，跳過了許多他認為大家都該知道的知識，那聽眾自然就會一頭霧水、甚至低估你所做出的結果，這會是非常可惜的一件事。我建議同學可以在日常生活中慢慢練習，像是跟同學討論作業時，不要假設對方會自行腦補，把對方當成這個領域的初學者，完整、清楚的敘述。",
        "第二點就是要過均衡的生活，這件事情的出發點是常會有學生表示自己不知道要怎麼好好地跟別人聊天，深入了解後會發現他們的休閒活動會過度單一，缺乏廣度的攝取，那如此一來自然地就很難跟別人有可以引起共鳴的話題，也比較難去理解他人的感受，這一點是需要有意識地嘗試以及練習的，雖然這段有些非傳統，但我認為這是生活中很重要的一環。",
        "除此之外，也希望大家能更加注重電子世界的禮節，像是現在很多學生都把電子郵件當通訊軟體用，寄了一封沒頭沒尾的信件，我連寄件者是誰都不清楚了，當然就很難做回覆了。"
      ]
    },
    {
      "subtopic": "想請問教授對於大一新生有什麼建議，才可以讓他們在大一下的時候能更好地面對資料結構與演算法這門課呢？以及大一新生在這堂課常會遇到的問題？",
      "answers": [
        "首先就是心態上要準備好，當你在成長過程中踏入下一個階段的那一個剎那，看到更高等級的戰場的這種衝擊感是很強烈的，心態上要準備好、要知道受挫會是一個常態，你會一直感受到甚麼都做不到的無力感，但要記得這是成長的過程，要試著去接受它。",
        "接下來呢就是要準備好充足的時間，修這門課的時候記得不要把時間塞太滿，我以前也是這樣的人，把很多事情通通包下來，然後全部炸開。這樣做雖然有它正面積極的地方，但也有可能把自己弄得很慘。所以，在修這門課之前，把時間、心態都要準備好，剩下的就是不要輕易的放棄了。",
        "最後一點是要給那些比較跟不上的同學。DSA （資料結構與演算法, 大一下必修）可能不是大家都能修一次就過關的課程，有些人可能會覺得為甚麼要這樣折磨學生，但就結果論而言，不論你有沒有修完這門課，都可以在其中學到東西，終究是成長了。希望大家修不過也不用太著急，反正教授也不會跑走，耐著性子慢慢修總是會過的，最怕的就是自我放棄，覺得自己甚麼都不可能完成。",
        "順帶一提，因為這些課程都有所謂的傳統在，我們會希望大家在經歷了各教授的圍毆之後，你就有台大資訊系要求的水準在，保有台大資訊系的品質水準對我們來說是很重要的，也因此希望大家可以堅持下去、不要放棄。"
      ]
    },
    {
      "subtopic": "請問教授建議學生如何在大學生活找到自己有興趣的領域，以及培養專業能力？",
      "answers": [
        "我自己是覺得，想辦法多去利用自己所學到的東西來解決日常發現的問題，很多同學會覺得可以去做專題、去實習，這些方法固然很好，但我覺得最關鍵的地方在於照著自己的想法、找出自己要做的事情以及該解決的問題，這跟專題以及實習可能是照著別人的意思做事還是有點差別的。",
        "我自己努力作為這方面的實踐者，像是 NASA 團隊（系上維護工作站與網路服務的團隊）、以及 NTU Cool （台大的課程網站）就是因為覺得舊有的制度以及設備等等不夠便利因而誕生的。舉更多相關的例子、像是 NTU Cool 調整影片速度的插件、把 Ceiba （台大老舊的課程網站）系統上的資料打包的工具等等，都是同學自己發起而完成的，是從問題一直演進到解決方案的完整過程，這些事情雖然辛苦，但你會發現從中可以獲得很大的成就感，因為真正有人因為你的技術而受惠。",
        "除此之外，將原有的興趣與所學結合也是很不錯的，尤其現在結合人工智慧等科技往往能產生意想不到的點子，像之前就有人利用深度學習來隨機產生動漫頭像，所以我覺得像這樣更生活化一點，可能是比較適合大家的一個出發點。"
      ]
    },
    {
      "subtopic": "請教授發表一下對出國唸書 / 留在國內升研究所的看法？",
      "answers": [
        "就出國來說，現在大部分同學出國的目的都是念碩士，接著在國外找工作，和念博士然後進入研究領域，我覺得是兩個不同的路徑。跟在台灣不同，在美國這個系統是這樣：大學畢業後，如果你想工作就直接去，其實不需要念 CS（Computer Science） 的 master（相當於台灣的碩士），想要研究就直接念 CS 的 Ph.D，也不需要念 master，美國大部分的碩士班反而是用來設計給大學部不是念資訊科學，但未來想走這方向的人。如果你是要出國做研究，那其實大學畢業就可以去申請博士班了。",
        "可是並不是所有人都適合，有些學生他準備好了，包含語文能力、對生活的適應能力、履歷表，畢竟博士生的錄取是很困難的一件事，相較於來自全球各地的其他申請者，大部分大學部的學生畢業時不會有很好的履歷，所以如果大學畢業想去申請美國好的學校的 Ph.D，大部分的大學生是做不到的。但是少部分的學生是做得到的，如果在大學的時候有繼續跟教授做專題，有些論文的發表，累積很好的一些研究經驗。其實我也是在台灣念完碩士之後才出國念書的，碩士有一個優點就是讓你對研究領域有比較深入的了解，有更長的時間讓自己準備好，特別是碩士以研究為主，你一定會累積比較多的研究經驗，可以幫助你申請到好的博士program，如果你想出國念碩士然後工作，那就要看你的經濟能力了，其實我有學生念完碩士出去工作了 3~5 年再到美國念碩士、 program，如果你想出國念碩士然後工作，那就要看你的經濟能力了，其實我有學生念完碩士出去工作了 3~5 年再到美國念碩士、工作，有些人在台灣工作之後發現到國外工作會更符合他想做的事，才決定出國，這個時間點不是早做就比較好，想清楚再去做就是了。"
      ]
    },
    {
      "subtopic": "想請問教授，現在許多課程都轉成大班教學、線上授課，教授對於這樣的趨勢有什麼樣的看法，以及對學生的改變如何呢？",
      "answers": [
        "這個大概可以講個三天，因為我個人就是大班授課的倡導者以及施行者，學校的立場暫且不提，我們從學生或是老師的立場出發，因為大班制下，助教的資源會比較多，這樣學生比較容易即時的得到助教的協助，能有一種被支持的感覺，我覺得這樣可以減緩許多前面所提到的，踏入下一階段的衝擊感。",
        "另外就是活動的部分，我很喜歡在課堂上參雜一些活動，有時候要能夠好好的吸收課堂的內容，和你們對於那門課的興趣是高度相關的，你只要對那門課有所期待，就會更願意去認真的去嘗試吸收裡面的內容，這些是我希望達成的效果，而有助教的幫忙才可以更好的推動這些活動。"
      ]
    },
    {
      "subtopic": "教授認為高中跟大學的學習環境還有方向有什麼差異，新生應該如何調整自己的學習方法，去面對這些變化？",
      "answers": [
        "總而言之就是：不要為了考試與分數而活，儘管上了大學，還是有很多地方是需要用到成績的，但實際上分數在這一塊的重要性已經慢慢地降低了，現在會更重視你完成了甚麼樣的事情、有甚麼樣的能力。",
        "有很多同學在大學依然過著讓分數最佳化的生活，對課程就只是為了拿到高分、淺嚐輒止，而沒有看得更深，我覺得是非常可惜的。雖然要做出調整需要花一些時間，畢竟台灣人與分數的羈絆非常深，即使是我們當老師的也有很多業務指標等等的要去注意，但唯有我們有意識的嘗試去做調整才有可能會改變。"
      ]
    },
    {
      "subtopic": "想請問教授在這幾年的教學經歷中，有沒有注意到我們這個世代有什麼特別有趣的現象，或是對我們這個世代有什麼建議？",
      "answers": [
        "第一點就是現在的學生好像不太喜歡翻書，平均而言，大家比較難長時間的耐著性子去做一件事情，現在大家都很習慣上各式影音平台、從影片吸收知識，我個人是覺得有點可惜，因為書本對於知識的整理是比較強的，也比較容易引入較深入的知識，當然影片也有很多好處，我也看了許多，但我覺得找到其中的平衡是很重要的。",
        "還有就是現在的學生比較會去對現有的體制表達不滿，那這件事情有好有壞，正面的地方在於，大家會去關心自己的權益，知道自己想要甚麼，並試著把這個社會引導向自己理想的那個方向，這是有其正面積極的意義的；但從另外一個角度來看，這些不滿往往流於抱怨而缺少一些有建設性的解決方案、或是沒有考慮背後的原因以及複雜之處，我覺得這很可惜，希望大家不要停止抱怨，但是後續的配套可以做得更完整，多去了解問題、思考好的解方。",
        "最後再補充一點，老師其實很需要學生的正面力量，大家在提出對於體制的不滿時也可以多鼓勵老師們做得不錯的地方。畢竟老師也是人，這些負能量持續累積，終究會失去做更多的動力。所以，多給助教跟老師一些正向的話語，相信對整個大環境會是一件很好的事情。"
      ]
    },
    {
      "subtopic": "教授還有想跟新生說的話嗎？",
      "answers": [
        "疫情對大家而言都是一個很難過的關卡，對老師而言就是要多去學習一些直播的工具，那對學生來講就是要去學習更有效率的學習方式，會更著重在自主性的部分，總之我希望能鼓勵新生要做自己的主人，去決定自己要如何地規劃、如何的學習，因為在這樣的時代下，我們更沒有辦法去輕忽這些決定的重要性。"
      ]
    }
  ]
}
