{
  "臺大學生心理輔導中心": {
    "subtitles": [
      {
        "subtitle": "臺大學生心理輔導中心",
        "content": "心輔中心位在臺大研一宿舍旁的望樂樓。由臨床心理師、諮商心理師、社會工作師、精神科醫師執照証照者與資教輔導人員組成，提供個人心理諮商、輔導等服務。不論是對於未來有迷惑、面對生活上的困境、遭遇轉折低潮等，都可以來心輔中心尋求幫助。初次使用心輔資源的同學需到網路上預約初談，讓輔導老師了解狀況、評估需求並安排後續的心理諮商或心理測驗。若有後續需求，則會為同學媒合適合自己的心理師，進行心理諮商。\n\n除了提供諮商與輔導外，心輔中心亦提供心理測驗、講座、工作坊等服務，加強校園心理健康促進。心輔中心也歡迎同學平時空閒時到中心看看書、翻翻雜誌，一同享受心輔中心溫暖舒適的空間。",
        "links": [
          {
            "name": "服務項目",
            "href": "https://scc_osa.ntu.edu.tw/Services"
          }
        ]
      }
    ]
  },
  "臺大學輔中心": {
    "subtitles": [
      {
        "subtitle": "臺大學輔中心",
        "content": "不同於心輔中心提供全校性的服務，學輔中心設有專員在分屬在各個學院，因此更能了解每位同學的不同學習環境、與可能遭遇的問題。專員不一定是心理師，因此他們的身分更像同學們的朋友，藉由聊天協助釐清想法，適應校園生活，或轉介心輔中心等其他資源。\n\n電資學院的學輔專員位在博理館 710 室的駐院學輔室，而駐點心理師位於博理館東側 310 室的心靈角落，目前有三位心理師，提供輔導諮詢，辦理講座、工作坊等服務。若有諮詢需求，可以透過網路預約專員或心理師進行諮詢。",
        "links": [
          {
            "name": "臺大學輔",
            "href": "https://csw.ntu.edu.tw/about.html"
          },
          {
            "name": "電資學輔",
            "href": "https://eecs.ntu.edu.tw/zh_tw/psychologist"
          }
        ]
      }
    ]
  },
  "系上輔導資源": {
    "subtitles": [
      {
        "subtitle": "資工系自聘的心理師",
        "content": "系上有自聘一位心理師，孫嘉琳老師，專門服務資工系所和網媒所的師生。在德田館 R441 提供一些短期心理諮詢，目的希望增進自我了解、解決生活中遭遇的困難、促進心理健康。目前諮詢採取預約制，有需要的同學可以填寫表單預約。同時心理師在學期中也會不定時寄信關懷各位同學的狀況，推薦書單、歌單等！同學不妨偶爾查看 CSIE Mail，看看有沒有心理師寄來的信件。"
      },
      {
        "subtitle": "系上導師",
        "list": [
          "個人專屬導師：每位同學根據學號都有分配一位系上的導師，可至 myNTU【導生綜合資料系統】查詢（檢視學籍 ⭢ 導師資訊）。若有需求可以寄信約時間商談，有時導師也會舉辦導生宴，與同學們交流。",
          "大一導師：大一生另有分配數名不分學號的導師，提供額外諮詢。",
          "關懷導師：每週固定時間開放 free talk或是用email預約，不論是課業問題、未來出路、選課規劃等都可以來與老師討論、分享。",
          "承滿姐：以上方式皆要事先預約或等待，若有即時需求或生活稍微喘不過氣，也可以直接到 R205 系辦找承滿姐聊天。若是下班時間，或是用文字比較自在，也都可以用 FB（搜尋：周承滿），承滿姐都會很願意傾聽的。"
        ]
      },
      {
        "subtitle": "校外諮商補助",
        "list": [
          "國立臺灣大學補助學生校外諮商方案：可補助學生於校外個別心理諮商費用。",
          "學生團保—心理檢康補助：可補助精神科/身心科醫師的心理諮商服務費用。",
          "衛福部青壯世代心理健康支持方案：補助15歲至45歲，每人三次心理諮商費用。"
        ]
      },
      {
        "subtitle": "學習規劃辦公室",
        "content": "教務處學習規劃室的主要服務為學習規劃師會談，協助學生善用校方資源，並進一步的提供修課與雙轉輔的建議。此外，也有提供多元背景的專家與同儕諮詢服務，引導學生進行修課規劃。"
      }
    ]
  }
}
